{
  "404": {
    "statusCode": "404",
    "errorMessage": "The URL you entered may be broken, or the page has been removed. <2>Go back to the home page</2>"
  },
  "dataDictionary": {
    "title": "New Relic data dictionary",
    "intro": "This data dictionary defines some of our default-reported data stored in NRDB and queryable via NRQL. This includes events like Transaction, MobileRequest, and BrowserInteraction, and our Metric, Log, and Span data types. These definitions are also available from our query builder UI by mousing over applicable data type and attribute names.",
    "introNot": [
      "This dictionary doesn't contain:",
      "Data from our infrastructure integrations (for that, see docs for a specific integration)",
      "Custom data",
      "Detailed integration-specific attributes for Metric data"
    ],
    "callout": "This dictionary does not contain data reported by Infrastructure integrations. To learn about that data, see the <2>integration documentation</2>."
  },
  "whatsNew": {
    "title": "What's new in New Relic"
  },
  "home": {
    "banner": {
      "title": "Welcome to \n New Relic docs!",
      "intro": {
        "p1": "We're here to help you monitor, debug, and improve your entire stack. If you're new to New Relic, read our <2>Introduction to New Relic doc</2>. Or get started right now by creating an account and installing a quickstart:"
      },
      "button1": "Create a free account",
      "button2": "Find your quickstart"
    },
    "welcome": {
      "t1": {
        "title": "Getting started"
      },
      "t2": {
        "title": "What's new"
      },
      "t3": {
        "title": "Popular content"
      }
    },
    "tdp": {
      "title": "Data and APIs",
      "description": "Ingest, visualize, and alert on all your telemetry data in one place.",
      "t1": {
        "title": "Data explorer",
        "description": "Query and build charts with NRQL, our PromQL-style syntax, or our visual chart builder."
      },
      "t2": {
        "title": "Dashboards",
        "description": "Combine data from anywhere in our platform into customized dashboards."
      },
      "t3": {
        "title": "APIs",
        "description": "Find APIs to send data in, get data out, or manage the New Relic platform."
      },
      "t4": {
        "title": "Manage data",
        "description": "Monitor and control your data usage."
      },
      "t5": {
        "title": "Build on New Relic One",
        "description": "Learn how to build custom apps on our platform at developer.newrelic.com"
      }
    },
    "fso": {
      "title": "Observability solutions",
      "description": "Analyze and troubleshoot problems easily across your entire software stack.",
      "t1": {
        "title": "APM",
        "description": "Get real-time and trending data about your app's performance and stability."
      },
      "t2": {
        "title": "Browser",
        "description": "Measure website performance, track errors, and see how users interact with your site."
      },
      "t3": {
        "title": "Distributed Tracing",
        "description": "Track requests through your distributed system to find trends and anomalies."
      },
      "t4": {
        "title": "Infrastructure",
        "description": "Monitor your infrastructure—hosts, cloud providers, container services, backend services, orchestrators, and more."
      },
      "t5": {
        "title": "Kubernetes and Pixie",
        "description": "Get instant Kubernetes observability. "
      },
      "t6": {
        "title": "Log Management",
        "description": "Get logs alongside your telemetry data with our fast, scalable log management."
      },
      "t7": {
        "title": "Mobile",
        "description": "Understand user journeys in your Android and iOS apps and troubleshoot crashes."
      },
      "t8": {
        "title": "Network Performance Monitoring",
        "description": "Monitor your network devices."
      },
      "t9": {
        "title": "Serverless",
        "description": "Monitor AWS Lambda, Azure Functions, and Google Cloud Functions."
      },
      "t10": {
        "title": "Synthetics",
        "description": "Simulate user activity to detect outages and fix poor website performance."
      },
      "t11": {
        "title": "Workloads",
        "description": "Group or monitor entities across your entire stack based on a team or a set of responsibilities."
      },
      "t12": {
        "title": "Service Levels management",
        "description": "Create and consume SLIs and SLOs."
      }
    },
    "ai": {
      "title": "Alerts and Applied Intelligence (AI)",
      "description": "Automatically detect anomalies, correlate issues, and reduce alert noise.",
      "t1": {
        "title": "Introduction to Alerts",
        "description": "Get notified about important changes in your system based on any data you connect to New Relic."
      },
      "t2": {
        "title": "Introduction to Applied Intelligence",
        "description": "Recognize issues sooner, resolve problems faster, and reduce noise for better incident management."
      },
      "t3": {
        "title": "Incident Intelligence",
        "description": "Get an overview of all your incidents. See sources and related events, and find out how they all correlate."
      },
      "t4": {
        "title": "Proactive Detection",
        "description": "Get notified by Slack or webhook of unusual app behavior."
      },
      "t5": {
        "title": "Workflows",
        "description": "Enrich your incidents with New Relic data before sending them to your notification platform."
      }
    },
    "integrations": {
      "title": "New Relic integrations",
      "description": "<0>Integrations</0> connect the technologies in your stack to New Relic. Here are a few of our <4>370+ integrations</4>:",
      "title1": "Back-end, front-end, and mobile applications",
      "title2": "Infrastructure and cloud platforms",
      "title3": "Open-source monitoring systems"
    },
    "mobile_apps": {
      "title": "New Relic mobile apps",
      "description": "View the power of NR1 in the palm of your hand."
    },
    "security": {
      "title": "Security, privacy, and legal information",
      "description": "Find out how we ensure security, data privacy, and compliance, and find our terms of service.",
      "t1": {
        "title": "Data privacy",
        "description": "New Relic takes your data privacy seriously. Our principles-based approach aims to go beyond the legal requirements for consent."
      },
      "t2": {
        "title": "Security compliance",
        "description": "Whether your data is in transit to New Relic or at rest in our storage, strong encryption measures can help protect against unauthorized access or theft of valuable data."
      },
      "t3": {
        "title": "Security bulletins",
        "description": "Security bulletins are a way for us to let you know about security vulnerabilities, remediation strategies, and applicable updates."
      },
      "t4": {
        "title": "Licenses",
        "description": "All about New Relic's licenses, Usage Plan, and policies. Find out what open source software we use in our products."
      }
    }
  },
  "subNav": {
    "homeLink": "Home",
    "filter": {
      "placeholder": "Filter navigation"
    }
  },
  "machineTranslation": {
    "calloutHeading": "This machine translation is provided for your convenience.",
    "calloutBody": "In the event of any inconsistency between the English version and the translated version, the <2>English version</2> shall prevail. Please visit <4>this page</4> for more information."
  }
}
