{
  "data": {
    "docs": {
      "dataDictionary": {
        "events": [
          {
            "attributes": [
              {
                "definition": "The ID of your application, as recorded by New Relic.",
                "name": "appId",
                "units": {
                  "label": "ID"
                }
              },
              {
                "definition": "The name of the application that handled the request as shown in browser monitoring.",
                "name": "appName",
                "units": null
              },
              {
                "definition": "Autonomous System Number: a unique number identifying a group of IP networks that serves the content to the end user.",
                "name": "asn",
                "units": null
              },
              {
                "definition": "The latitude of the geographic center of the postal code where the Autonomous System Network is registered. This is not the end user's latitude.",
                "name": "asnLatitude",
                "units": null
              },
              {
                "definition": "The longitude of the geographic center of the postal code where the Autonomous System Network is registered. This is not the end user's longitude.",
                "name": "asnLongitude",
                "units": null
              },
              {
                "definition": "The organization that owns the Autonomous System Number. Often an ISP, sometimes a private company or institution.",
                "name": "asnOrganization",
                "units": null
              },
              {
                "definition": "The backend response time in seconds.\n\nIncludes app server (webAppDuration) and network time (networkDuration), as well as queue time if available. Representative of Time to First Byte. Derived from the Navigation Timing API as responseStart minus navigationStart.",
                "name": "backendDuration",
                "units": {
                  "label": "seconds (s)"
                }
              },
              {
                "definition": "The transaction name (page view group) as it appears in New Relic Browser.",
                "name": "browserTransactionName",
                "units": null
              },
              {
                "definition": "The city in which the event occurred, such as Portland or Seattle.",
                "name": "city",
                "units": null
              },
              {
                "definition": "The time to establish a connection with the server in seconds (inclusive of secureHandshakeDuration). Derived from the Navigation Timing API as connectEnd minus connectStart.",
                "name": "connectionSetupDuration",
                "units": {
                  "label": "seconds (s)"
                }
              },
              {
                "definition": "The country from which the browser initiated the page load. For a list of country codes, see ISO 3166-1 alpha-2.",
                "name": "countryCode",
                "units": null
              },
              {
                "definition": "The type of device that loaded the page: mobile, tablet, or desktop.",
                "name": "deviceType",
                "units": null
              },
              {
                "definition": "The time to resolve the DNS record for the top-level resource (in seconds). Derived from the Navigation Timing API as domainLookupEnd minus domainLookupStart.",
                "name": "dnsLookupDuration",
                "units": {
                  "label": "seconds (s)"
                }
              },
              {
                "definition": "The domain portion of the request URL.",
                "name": "domain",
                "units": null
              },
              {
                "definition": "The time it takes to parse the HTML into a DOM and retrieve or execute synchronous scripts.\n\nOften includes time for scripts and static assets to be retrieved. Derived from the Navigation Timing API as domContentLoadedEventEnd minus responseStart.",
                "name": "domProcessingDuration",
                "units": {
                  "label": "seconds (s)"
                }
              },
              {
                "definition": "The browser response time in seconds. Derived from the Navigation Timing API as loadEventEnd minus navigationStart.",
                "name": "duration",
                "units": {
                  "label": "seconds (s)"
                }
              },
              {
                "definition": "firstContentfulPaint is the point when the browser renders the first bit of content from the DOM, which may be text, an image, SVG, or a &lt;canvas&gt; element.\n\nGoogle's User-centric Performance Metrics contains detailed information about its Paint Timing API and firstContentfulPaint.\n\nSee Compatibility and requirements for New Relic Browser for additional information about firstContentfulPaint browser compatibility.",
                "name": "firstContentfulPaint",
                "units": null
              },
              {
                "definition": "firstPaint marks the point when the browser renders anything that is visually different from what was on the screen prior to navigation. This includes non-default background paint and the enclosing box of an iframe.\n\nGoogle's User-centric Performance Metrics contains detailed information about its Paint Timing API and firstPaint.\n\nSee Compatibility and requirements for New Relic Browser for additional information about firstPaint browser compatibility.",
                "name": "firstPaint",
                "units": null
              },
              {
                "definition": "The name of the invoked web transaction. For example: Controller/customers/show.",
                "name": "name",
                "units": null
              },
              {
                "definition": "The total time spent in redirects as well as in requesting and receiving HTML (in seconds). If webAppDuration (server side timing information) is not available, time on the server will be included in this duration.",
                "name": "networkDuration",
                "units": {
                  "label": "seconds (s)"
                }
              },
              {
                "definition": "The page rendering phase is the time between DOM completion (domContentLoadedEventEnd) and the window load event (loadEventEnd), in seconds. This phase measures browser-side processing and display of the page content.",
                "name": "pageRenderingDuration",
                "units": {
                  "label": "seconds (s)"
                }
              },
              {
                "definition": "The URL of the page that was loaded for the PageView, for example: http://www.newrelic.com. This URL does not include query parameters.",
                "name": "pageUrl",
                "units": null
              },
              {
                "definition": "The total time the request waits for a service to initiate (in seconds).",
                "name": "queueDuration",
                "units": {
                  "label": "seconds (s)"
                }
              },
              {
                "definition": "The specific administrative division within a country where the PageView event occurred. In the United States, regions correspond to state codes, such as WA or NY. Outside the United States, a country's regions correspond to numerical codes.\n\nIn the United States, regions correspond to state codes ; for example, WA or NY. Outside the United States, a country's regions correspond to numerical codes .",
                "name": "regionCode",
                "units": null
              },
              {
                "definition": "A subset of connectionSetupDuration, the time to establish a TLS connection with the server. Derived from the Navigation Timing API as connectEnd minus secureConnectionStart (in seconds).",
                "name": "secureHandshakeDuration",
                "units": {
                  "label": "seconds (s)"
                }
              },
              {
                "definition": "A unique identifier for a single session. The session cookie expires when the user closes the browser (for example, they fully exit Chrome.) A new session identifier will be assigned when the user opens up a new instance of the browser.",
                "name": "session",
                "units": null
              },
              {
                "definition": "The time (date, hour, minute, second) at which the interaction occurred.",
                "name": "timestamp",
                "units": null
              },
              {
                "definition": "The browser’s name, such as Chrome and Firefox, obtained from the User-Agent header of an HTTP request.",
                "name": "userAgentName",
                "units": null
              },
              {
                "definition": "The browser’s reported operating system, such as Windows or Linux, that it is running on. This is obtained from the User-Agent header of an HTTP request.",
                "name": "userAgentOS",
                "units": null
              },
              {
                "definition": "The browser’s reported software version, which is obtained from the User-Agent header of an HTTP request.",
                "name": "userAgentVersion",
                "units": null
              },
              {
                "definition": "The total server-side response time for the top-level resource of the PageView (in seconds) as measured by the APM agent.\n\nThis does not include network time to transmit the request or receive the response, or server-side request queueing time. The webAppDuration is measured by the APM agent and must be injected into the browser monitoring script before the request is fully finished. Its end point is slightly before the end point used to calculate the duration attribute on Transactions, so webAppDuration will be slightly less than the duration attribute on Transactions in practice.",
                "name": "webAppDuration",
                "units": {
                  "label": "seconds (s)"
                }
              }
            ],
            "name": "PageView"
          }
        ]
      }
    }
  }
}