{
  "/docs/agents/ruby-agent/features/ruby-vm-measurements": [
    {
      "image": "https://newrelic.com/themes/custom/curio/assets/images/metadata/NROG_Image.png",
      "url": "https://newrelic.com/press-releases/20100224",
      "sections": [
        "New Relic RPM Now Manages Ruby Web Applications Running with Sinatra, Rack, and Rails Metal",
        "Comprehensive Web Application Management",
        "About New Relic",
        "Media Contact",
        "Investor Contact"
      ],
      "published_at": "2021-02-22T14:45:58Z",
      "title": "New Relic RPM Now Manages Ruby Web Applications Running with Sinatra, Rack, and Rails Metal | New Relic",
      "updated_at": "2021-02-22T14:45:58Z",
      "type": "",
      "external_id": "33c5857bd864b68ba34f976206dff170076e128f",
      "popularity": 1,
      "body": "Skip to main content New Relic logo Search Submit Products Products New Relic One Platform Overview Telemetry Data Platform Full-Stack Observability Applied Intelligence Pricing Solutions Solutions By Topic DevOps Cloud Adoption Cloud Native Digital Customer Experience Tool Consolidation Open Source By Industry E-commerce and Retail Media Public Sector By Technology Amazon Web Services Pivotal Cloud Foundry Microsoft Azure Google Cloud Platform Kubernetes Help Center Help Center Learn Docs Build on New Relic Explore open source projects Training The Relicans Get help Community forum Global technical support Expert services About About Our Customers Over 17,000 customers love New Relic, from Fortune 500 enterprises to small businesses around the globe. Our Blog The latest news, tips, and insights from the world of New Relic and digital intelligence. Our Company About Us Leadership Meetups and Events Resources Social Impact Investor Relations Newsroom Partner Program Contact Us New Relic for iOS or Android New Relic Insights App for iOS Search toggle Log in Sign up Main navigation menu, 5 items Newsroom Press Release New Relic RPM Now Manages Ruby Web Applications Running with Sinatra, Rack, and Rails Metal Leading performance tool lets Ruby and Java developers monitor and optimize web applications that utilize latest technologies Share on Facebook Share on Twitter Share on LinkedIn San Francisco - February 24, 2010 New Relic, Inc., the leading software-as-a-service provider of application performance management solutions, today announced that the latest release of its RPM application performance management tool has added support for Sinatra, Rack, and Rails Metal, enabling Ruby developers and operations teams to monitor, troubleshoot, and optimize web applications that utilize these technologies. This support is one of several advanced capabilities for Ruby web application management available now. \"Rack has given Ruby web developers a tremendous amount of freedom to innovate and experiment with new ways of building web applications,\" said Ryan Tomayko, a member of the core committer team for both Rack and Sinatra. \"Developers are increasingly turning to Rack and lightweight frameworks like Sinatra for small utility apps or for latching performance critical features onto an existing site. The ability to monitor and profile these applications using New Relic RPM fills a huge visibility gap for us.\" Written in Ruby, Sinatra is an open source web application framework and domain-specific language (DSL) that enables rapid development of Ruby web applications. Rack is modular interface for developing Ruby web applications that simplifies the interaction between HTTP requests and other web application software components by distilling APIs for these systems into a single method call. Rails Metals are minimal Rack applications that enable requests to be served more quickly. New Relic RPM is an on-demand performance management solution for web applications developed in Java, Ruby, or JRuby. RPM now provides real-time monitoring and metrics for applications running Sinatra, Rack and Rails Metals so development and deployment teams can quickly and cost-effectively monitor, troubleshoot, and tune Ruby web application performance to meet business goals. \"In the newest version of RPM’s Ruby agent we’ve added a number of significant features and support for Sinatra, Rack and Metals rank high among them,\" said Jim Gochee, New Relic’s vice-president of engineering. \"One of the great things about developing a SaaS monitoring tool and being involved with the Ruby community is witnessing the constant innovation as more and more teams deploy business-critical Ruby web applications. Sinatra and Rack are two important examples of ongoing efforts to simplify the creation of traditionally complex web applications and we look forward to working with our customers and partners as they take advantage of these projects.\" Comprehensive Web Application Management Additional features of the New Relic RPM Ruby agent 2.10 include: Enhanced Visibility into Ruby EE Garbage Collection Passenger Queue Time Capture Profiling built in to Developer Mode Enhanced JRuby Support Existing New Relic customers can download the New Relic RPM Ruby Agent 2.10 either by logging in to the RPM and selecting the upgrade option or at GitHub. To use New Relic RPM for Ruby or Java web applications for free, download RPM Lite, which includes proven application monitoring and troubleshooting capabilities. It installs in two minutes and supports multiple application servers and frameworks including Rails, Sinatra, and Rack for Ruby as well as WebSphere, Oracle WebLogic, JBoss, Grails, Tomcat, Glassfish, Jetty, Spring, and more for Java. Back to press releases About New Relic The world’s best engineering teams rely on New Relic to visualize, analyze and troubleshoot their software. New Relic One is the most powerful cloud-based observability platform built to help companies create more perfect software. Learn why customers trust New Relic for improved uptime and performance, greater scale and efficiency, and accelerated time to market at newrelic.com. New Relic is a registered trademark of New Relic, Inc. All product and company names herein may be trademarks of their registered owners. New Relic on Facebook New Relic on Twitter New Relic on LinkedIn New Relic on YouTube Media Contact Andrew Schmitt 415-869-7109 PR@newrelic.com Investor Contact Peter Goldmacher 503-336-9280 IR@newrelic.com Company Careers and Culture Partner Program Investor Relations NewRelic.org Suppliers Portal Connect Contact Us Request Demo Events International 日本語 Français Deutsch 한국어 Facebook Twitter LinkedIn YouTube Instagram Terms of Service DMCA Policy Privacy Policy Cookie Policy UK Slavery Act of 2015 ©2008-21 New Relic, Inc. All rights reserved",
      "info": "",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 111.85902,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "title": "New Relic RPM Now Manages <em>Ruby</em> Web Applications Running with Sinatra, Rack, and Rails Metal | New Relic",
        "sections": "New Relic RPM Now Manages <em>Ruby</em> Web Applications Running with Sinatra, Rack, and Rails Metal",
        "body": ". &quot;In the newest version of RPM’s <em>Ruby</em> <em>agent</em> we’ve added a number of significant <em>features</em> and support for Sinatra, Rack and Metals rank high among them,&quot; said Jim Gochee, New Relic’s vice-president of engineering. &quot;One of the great things about developing a SaaS monitoring tool and being involved"
      },
      "id": "575f8b75c75d075a53c38d8a"
    },
    {
      "category_2": "iOS app release notes",
      "nodeid": 8411,
      "sections": [
        "Mobile apps release notes",
        "Android app release notes",
        "iOS app release notes",
        "Insights for Android release notes",
        "Insights for iOS release notes",
        "Insights for tvOS release notes",
        "New Relic for iOS 3.20.3",
        "New Relic for iOS 3.52.1",
        "Notes",
        "New features",
        "Improvements",
        "New Relic for iOS 3.51.1",
        "New Relic for iOS 3.50.0",
        "New Relic for iOS 3.49.0",
        "Bug fixes",
        "New Relic for iOS 3.48.0",
        "New Relic for iOS 3.47.0",
        "New Relic for iOS 3.46.1",
        "New Relic for iOS 3.46.0",
        "New Relic for iOS 3.45.0",
        "Pages"
      ],
      "title": "New Relic for iOS 3.20.3",
      "category_0": "Release notes",
      "type": "docs",
      "category_1": "Mobile apps release notes",
      "external_id": "9669033863e7160d64a91d6de37637bd8e50e0f6",
      "image": "",
      "url": "https://docs.newrelic.com/docs/release-notes/mobile-apps-release-notes/new-relic-ios-3203?page=0%2C2",
      "published_at": "2021-02-24T14:12:18Z",
      "updated_at": "2021-02-24T14:12:17Z",
      "breadcrumb": "Contents / Release notes / Mobile apps release notes / iOS app release notes",
      "document_type": "release_notes",
      "popularity": -2,
      "body": "[RSS] Items per page 5 10 New Relic for iOS 3.52.1 Tuesday, November 12, 2019 - 09:00 Download Notes Support for iOS 13 dark mode!!! New features Dark mode support for iOS 13 New crashes tab in Mobile APM, with improved grouping, searching and filtering Added in Synthetics monitors to the iPad Improvements Fix for showing a retry login popup when we shouldn't be Enable auto resizing of the y axis in charts, to scale to the visible time window Update APM app error rate to reflect the web New Relic for iOS 3.51.1 Friday, September 13, 2019 - 14:30 Download Notes The New Relic app is even better with an improved home screen, displaying all your favorite services, hosts, mobile and browser apps, key transactions, and more. This enhanced landing page also allows you to search across services, apps and hosts! New features Added new home screen with favorite APM, Mobile, and Browser apps, Infrastructure hosts, key transactions, and plugin instances. Added search to the home screen, to quickly search across APM, Mobile, Browser apps, hosts and key transactions. Improvements Updated Infrastructure, when viewing a filter set, to show all hosts in the charts (up to 20) by default. New Relic for iOS 3.50.0 Wednesday, July 31, 2019 - 12:00 Download Notes Improved and redesigned Browser product within the app! New features New Browser single page app (SPA) overview charts Added support to display in progress Browser violations and recent events Added support to display Browser page views Added support to display Browser JS errors Improvements Improved real agents call in APM Added link in app to license documentation New Relic for iOS 3.49.0 Wednesday, May 15, 2019 - 10:00 Download Notes Synchronizes app favorites with New Relic One for a consistent way to get access to those APM apps, Browser apps, Mobile apps, and Synthetics monitors wherever you might be. Improvements Uses the same data source for favorites as New Relic One Merges any iPhone / iPad specific favorites into your New Relic One favorites Updates Apdex charts to zoom in on the y axis to better show smaller variations Update Transaction trace bar to closer match the web in some edge cases Bug fixes Fixed an issue where searching in the APM Error attributes or stack traces would result in strange behavior Fixes an issue in the host / instance popup where the web response time was off by an order of magnitude New Relic for iOS 3.48.0 Thursday, April 11, 2019 - 09:00 Download New features Additional information for Java instances and Elixir hosts in the APM application detail section. New host / instance drop down for APM applications showing summary information, and allowing you to filter the APM page to a specific host or instance. Improvements Update to the Mobile APM summary page to allow the view to load for more customers New Relic for iOS 3.48.0 Thursday, April 11, 2019 - 09:00 Download Notes Our new APM memory / threads section now works with Java & Elixir agents! Improvements Additional information for Java instances and Elixir hosts in the APM application detail section. New host / instance drop down for APM applications showing summary information, and allowing you to filter the APM page to a specific host or instance. Update to the Mobile APM summary page, so that some edge cases will now load. New Relic for iOS 3.47.0 Monday, March 18, 2019 - 09:00 Download New features Additional information for hosts of Ruby, Node.js, and Go APM applications. Bug fixes Fixed a crash when tapping logout on the iPad Fixed for some Synthetics monitors not loading Fixed a few other infrequent crashes New Relic for iOS 3.46.1 Monday, February 11, 2019 - 09:00 Download Bug fixes Fixed the problem with muting, and enabling / disabling Synthetics monitors New Relic for iOS 3.46.0 Tuesday, January 29, 2019 - 14:15 Download Improvements Updated account settings screen enables seamless transition between users and accounts Bug fixes Fixed rare crash when saml users return from authenticating New Relic for iOS 3.45.0 Thursday, January 3, 2019 - 14:15 Download Notes This version contains enhanced notifications, with support for selecting unique sounds for different types of notifications, along with showing a chart image for incidents. New features Select different notification sounds for push notifications to the app. Shows incident open / closed chart image in the notification. Bug fixes Fix for filtering apmApplicationIds and apmApplicationNames properly in Infrastructure. Fixed a crash when trying to search through plugin components. Fixed a crash in Radar. Pages « first ‹ previous 1 2 3 4 5 6 7 8 9 next › last »",
      "info": "",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 93.54953,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "sections": "New <em>features</em>",
        "body": " will now load. New Relic for iOS 3.47.0 Monday, March 18, 2019 - 09:00 Download New <em>features</em> Additional information for hosts of <em>Ruby</em>, Node.js, and Go APM applications. Bug fixes Fixed a crash when tapping logout on the iPad Fixed for some Synthetics monitors not loading Fixed a few other infrequent"
      },
      "id": "5b6b681ab5b9e13ebbb11a80"
    },
    {
      "category_2": "iOS app release notes",
      "nodeid": 8411,
      "sections": [
        "Mobile apps release notes",
        "Android app release notes",
        "iOS app release notes",
        "Insights for Android release notes",
        "Insights for iOS release notes",
        "Insights for tvOS release notes",
        "New Relic for iOS 3.20.3",
        "New Relic for iOS 3.36.0",
        "New features",
        "Improvements",
        "Bug fixes",
        "New Relic for iOS 3.35",
        "New Relic for iOS 3.34.2",
        "New Relic for iOS 3.34",
        "Notes",
        "New Relic for iOS 3.33.0",
        "New Relic for iOS 3.32.2",
        "New Relic for iOS 3.32.1",
        "New Relic for iOS 3.32.0",
        "New Relic for iOS 3.31.2",
        "New Relic for iOS 3.31.1",
        "Pages"
      ],
      "title": "New Relic for iOS 3.20.3",
      "category_0": "Release notes",
      "type": "docs",
      "category_1": "Mobile apps release notes",
      "external_id": "043a44196d571574861e718952b473b74f8a7ec1",
      "image": "",
      "url": "https://docs.newrelic.com/docs/release-notes/mobile-apps-release-notes/new-relic-ios-3203?page=0%2C4",
      "published_at": "2021-02-24T14:12:18Z",
      "updated_at": "2021-02-24T14:12:18Z",
      "breadcrumb": "Contents / Release notes / Mobile apps release notes / iOS app release notes",
      "document_type": "release_notes",
      "popularity": -2,
      "body": "[RSS] Items per page 5 10 New Relic for iOS 3.36.0 Friday, December 22, 2017 - 12:00 Download New features Added the Hosts screen in the Infrastructure product, which replaces the older Compute Improvements Changed fonts to OpenSans Added FaceID support Bug fixes Fixed UI bug in instances screen in APM Fixed UI bug where Apdex & throughput were swapped on the iPad Fixed bug in Infrastructure where you were unable to search Fixed a crash in Radar New Relic for iOS 3.35 Wednesday, November 1, 2017 - 16:00 Download New features Support for the new iPhone X Improvements Improved filtering in the Infrastructure product, allowing for multiple selection's within a category Bug fixes Fix a crash in Radar when viewing week over week cards Fix a crash in Radar when typing @ in the comments bar New Relic for iOS 3.34.2 Monday, September 25, 2017 - 12:00 Download New features Added in universal link support for Radar Improvements Improve some markdown rendering issues Bug fixes Fix for time window issues in detail views Fix Infrastructure filters when multiple items are selected in the filter set New Relic for iOS 3.34 Wednesday, September 13, 2017 - 06:00 Download Notes Introducing Radar Radar provides analytic recommendations via cards which contains interesting, relevant, and actionable data about a specific service or the ecosystem as a whole. With four card types—Advice, Perspective, Events, and Celebrations—New Relic intelligently delivers insights to an individual, who can easily share the card with their team via a built-in integration with Slack. Radar continues to be rolled out to customers paying at the Pro level or higher. New features Added in support to display Radar within the app New Relic for iOS 3.33.0 Thursday, July 20, 2017 - 14:15 Download Improvements Updated tooltips on every chart Improved login flow for Touch ID Bug fixes Fixed a crash in the errors view. New Relic for iOS 3.32.2 Thursday, June 15, 2017 - 10:45 Download New features Added compare with yesterday and last week charts in the APM, Key Transaction & Browser sections. ** Toggle this from the time picker. At the top is a new 'Compare with yesterday and last week' button. Added tooltips on every chart ** Access this by long pressing on any chart, and then sliding your finger around. New Relic for iOS 3.32.1 Friday, May 26, 2017 - 15:00 Download Improvements Adds additional animations to Health Map Bug fixes Fixes a crash when viewing error traces from the Go language agents New Relic for iOS 3.32.0 Wednesday, May 24, 2017 - 00:00 Download Notes As enterprises adopt more scalable microservice architectures, it becomes more difficult to pinpoint performance issues within the application stack. New Relic’s new health map feature brings together insights on application and infrastructure performance into a single, prioritized view. This unified view enables operations and DevOps teams to quickly understand if the source of a performance issue is from the application code or in the infrastructure layer. New features Health Map support New Relic for iOS 3.31.2 Tuesday, May 16, 2017 - 15:00 Download Bug fixes Fixes a crash when viewing traced errors without stack traces Fixes a sharing issue when a warning violation does not have an associated incident. New Relic for iOS 3.31.1 Tuesday, May 9, 2017 - 15:00 Download New features Adds in a sharing option for Alert Incidents & Violations. Improve the UI in the Errors detail view. RBAC checks for acknowledging alerts & resolving crashes Bug fixes Fixes a UI coloring issue in the Transaction detail. Fixes a rare crash in the application detail view. Pages « first ‹ previous 1 2 3 4 5 6 7 8 9 next › last »",
      "info": "",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 86.05467,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "sections": "New <em>features</em>",
        "body": "[RSS] Items per page 5 10 New Relic for iOS 3.36.0 Friday, December 22, 2017 - 12:00 Download New <em>features</em> Added the Hosts screen in the Infrastructure product, which replaces the older Compute Improvements Changed fonts to OpenSans Added FaceID support Bug fixes Fixed UI bug in instances screen"
      },
      "id": "5f24dd3264441f2c2075e7f5"
    },
    {
      "category_2": "Enable and configure",
      "nodeid": 17021,
      "sections": [
        "Distributed tracing",
        "Get started",
        "Enable and configure",
        "Infinite Tracing",
        "UI and data",
        "Trace API",
        "Troubleshooting",
        "Language agents: Enable distributed tracing",
        "Step 1. Prerequisites",
        "Step 2. Set up Infinite Tracing (optional)",
        "Step 3. Configure the agent",
        "Step 4. View traces",
        "Manual instrumentation (If automatic instrumentation doesn't work)",
        "For more help"
      ],
      "title": "Language agents: Enable distributed tracing",
      "category_0": "Understand dependencies",
      "type": "docs",
      "category_1": "Distributed tracing",
      "translation_ja_url": "https://docs.newrelic.co.jp/docs/understand-dependencies/distributed-tracing/enable-configure/language-agents-enable-distributed-tracing",
      "external_id": "92f81f3ba78006bec29baec46891cf6cfb1c9468",
      "image": "",
      "url": "https://docs.newrelic.com/docs/understand-dependencies/distributed-tracing/enable-configure/language-agents-enable-distributed-tracing",
      "published_at": "2021-02-22T15:09:15Z",
      "updated_at": "2021-02-15T14:13:55Z",
      "breadcrumb": "Contents / Understand dependencies / Distributed tracing / Enable and configure",
      "document_type": "page",
      "popularity": 1,
      "info": "How to enable distributed tracing or Infinite Tracing for APM agents.",
      "body": "Here's what you need to know for enabling either standard distributed tracing or Infinite Tracing with our language agents. If you want to get more background before getting started, check out these topics: How span sampling works explains distributed tracing options. Impacts to APM tells you what to expect if you are a current APM user. The process of enabling distributed tracing takes you through these steps: Meet the prerequisites (Infinite Tracing) Set up a trace observer Configure your agents View traces Step 1. Prerequisites Check the following sections to confirm that the distributed tracing options you want are available for your environment. Your main options are: Standard distributed tracing: Head-based sampling Infinite Tracing: Tail-based sampling Support for W3C Trace Context: Available in all Infinite Tracing agents and in standard distributed tracing agents as noted Once you find the agent version with the features you want, follow the links for help installing or updating your agent. For best results, update existing agents to the latest version. C SDK Install (compile) or update to the required C SDK version. For best results, update to the latest C SDK version. Option C SDK version Standard distributed tracing 1.1.0 or higher (W3C Trace Context not available) Infinite Tracing Not available Go Install or update to the required Go agent version. For best results, update to the latest Go agent version. Option Go agent version Standard distributed tracing 2.1.0 or higher With W3C Trace Context: 3.1.0 or higher Infinite Tracing v3.5.0 (includes W3C Trace Context) Supported environments: Go 1.9 or higher Java Install or update to the required Java agent version. For best results, update to the latest Java agent version. Your JVM's networkaddress.cache.ttl security setting must not be set to forever (i.e. -1). For more information about this networking property, please visit the Oracle Network Properties docs. Type Java agent version Standard distributed tracing 4.3.0 or higher With W3C Trace Context: 5.10 or higher Infinite Tracing 5.12.1 or higher (includes W3C Trace Context) Supported environments: Java 8: Update 252 or higher All versions of Java 9 or higher For special considerations, see Infinite Tracing: Configuring SSL for Java 7 and 8. .NET Install or update to the required .NET agent version. For best results, update to the latest .NET agent version. Option .NET agent version Standard distributed tracing 8.6.45.0 or higher With W3C Trace Context: 8.27.139.0 or higher Infinite Tracing 8.30.0 (includes W3C Trace Context) Supported environments: .NET Framework 4.5 or higher .NET Core 2.0 or higher Node.js Install or update to the required Node.js agent version. For best results, update to the latest Node.js agent version. Option Node.js agent version Standard distributed tracing 4.7.0 or higher With W3C Trace Context: 6.4 or higher Infinite Tracing 7.1.1 (includes W3C Trace Context) Supported environments: Node version 10.10.0 or higher PHP Install or update to the required PHP agent version. For best results, update to the latest PHP agent version. Option PHP agent version Standard distributed tracing 8.4 or higher With W3C Trace Context: 9.8 or higher Infinite Tracing 9.12.0.268 or higher Python Install or update to the required Python agent version. For best results, update to the latest Python agent version. Option Python agent version Standard distributed tracing 4.2.0.100 or higher With W3C Trace Context: 5.6 or higher Infinite Tracing 5.12.0.140 (includes W3C Trace Context) Supported environments: CPython only (pypy is unsupported) Ruby Install or update to the required Ruby agent version. For best results, update to the latest Ruby agent version. Also install the additional Ruby agent gem for Infinite Tracing. Option Ruby agent version Standard distributed tracing newrelic_rpm 5.3.0.346 or higher With W3C Trace Context: newrelic_rpm 6.9 or higher Infinite Tracing newrelic_rpm 6.11.0.365 or higher (includes W3C Trace Context) newrelic-infinite_tracing 6.11.0.375 or higher Step 2. Set up Infinite Tracing (optional) For all language agents except C SDK, you have the option of enabling Infinite Tracing. If you want to skip this and install standard distributed tracing, skip to Configure the agent. If you want to enable Infinite Tracing, see Set up trace observer. When you're done, return here to complete the next step of configuring the agent to send data to the trace observer. Step 3. Configure the agent Distributed tracing is enabled through configuration settings. Review the following agent-specific sections. If you're enabling Infinite Tracing, there are different configuration options for that. For more about agent configuration, see Configure the agent. Server-side configuration is not available for Infinite Tracing. C SDK Here's an overview of the settings. For more help with configuration, see Enable distributed tracing for your C applications. Type Required configuration Standard distributed tracing Configuration examples: newrelic_app_config_t structure: newrelic_app_config_t* config; config = newrelic_create_app_config(app_name, license_key); config->distributed_tracing.enabled = true; Infinite Tracing Not available Go Here's an overview of the settings. For more help with configuration, see Enable distributed tracing for your Go applications. Type Required configuration Standard distributed tracing Configuration examples: ConfigOption structure: newrelic.NewApplication( newrelic.ConfigAppName(\"Example App\"), newrelic.ConfigLicense(os.Getenv(\"NEW_RELIC_LICENSE_KEY\")), newrelic.ConfigDistributedTracerEnabled(true), ) Environment variable: NEW_RELIC_DISTRIBUTED_TRACING_ENABLED=true Infinite Tracing Configuration examples: newrelic.Config structure: app, err := newrelic.NewApplication( newrelic.ConfigAppName(YOUR_APP_NAME), newrelic.ConfigLicense(YOUR_LICENSE_KEY), func(cfg *newrelic.Config) { cfg.DistributedTracer.Enabled = true cfg.InfiniteTracing.TraceObserver.Host = YOUR_TRACE_OBSERVER_HOST }, ) Environment variables: NEW_RELIC_DISTRIBUTED_TRACING_ENABLED=true NEW_RELIC_INFINITE_TRACING_TRACE_OBSERVER_HOST=YOUR_TRACE_OBSERVER_HOST Java Here's an overview of the settings. For more help with configuration, see Java agent configuration: Config file. Type Required configuration Standard distributed tracing Configuration examples: Configuration file (newrelic.yml) (indented 2 spaces under the common stanza): distributed_tracing: enabled: true Java system property: -Dnewrelic.config.distributed_tracing.enabled=true Environment variable: NEW_RELIC_DISTRIBUTED_TRACING_ENABLED=true Infinite Tracing Configuration examples: Configuration file (newrelic.yml) (indented 2 spaces under the common stanza): distributed_tracing: enabled: true infinite_tracing: trace_observer: host: \"YOUR_TRACE_OBSERVER_HOST\" Java system property: -Dnewrelic.config.distributed_tracing.enabled=true -Dnewrelic.config.infinite_tracing.trace_observer.host=\"YOUR_TRACE_OBSERVER_HOST\" Environment variable: NEW_RELIC_DISTRIBUTED_TRACING_ENABLED=true NEW_RELIC_INFINITE_TRACING_TRACE_OBSERVER_HOST=\"YOUR_TRACE_OBSERVER_HOST\" .NET Here's an overview of the settings. For more help with configuration, see .NET agent configuration. Type Required configuration Standard distributed tracing Configuration examples: Configuration file (newrelic.config): <configuration . . . > <distributedTracing enabled=\"true\" /> </configuration> Environment variable: NEW_RELIC_DISTRIBUTED_TRACING_ENABLED=true Infinite Tracing Configuration examples: Configuration file (newrelic.config): <configuration . . . > <distributedTracing enabled=\"true\" /> <infiniteTracing> <trace_observer host=\"YOUR_TRACE_OBSERVER_HOST\" /> </infiniteTracing> </configuration> Environment variable: NEW_RELIC_DISTRIBUTED_TRACING_ENABLED=true NEW_RELIC_INFINITE_TRACING_TRACE_OBSERVER_HOST=\"YOUR_TRACE_OBSERVER_HOST\" Node.js Here's an overview of the settings. For more help with configuration, see Node.js agent configuration. Type Required configuration Standard distributed tracing Configuration examples: Configuration file (newrelic.js): distributed_tracing: { enabled: true } Environment variable: NEW_RELIC_DISTRIBUTED_TRACING_ENABLED=true Infinite Tracing Configuration examples: Configuration file (newrelic.js): distributed_tracing: { enabled: true } infinite_tracing: { trace_observer: { host: 'YOUR_TRACE_OBSERVER_HOST' } } Environment variable: NEW_RELIC_DISTRIBUTED_TRACING_ENABLED=true NEW_RELIC_INFINITE_TRACING_TRACE_OBSERVER_HOST=\"YOUR_TRACE_OBSERVER_HOST\" PHP Here's an overview of the settings. For more help with configuration, see Distributed tracing for the PHP agent Type Required configuration Standard distributed tracing Configuration examples: Configuration file (newrelic.ini): newrelic.distributed_tracing_enabled = true Infinite Tracing Configuration examples: Configuration file (newrelic.ini): newrelic.distributed_tracing_enabled = true newrelic.span_events_enabled = true newrelic.infinite_tracing.trace_observer.host= \"YOUR_TRACE_OBSERVER_HOST\" Python Here's an overview of the settings. For more help with configuration, see Python agent configuration Type Required configuration Standard distributed tracing Configuration file (newrelic.ini): distributed_tracing.enabled = true Environment variable: NEW_RELIC_DISTRIBUTED_TRACING_ENABLED=true Infinite Tracing Use the following installation command: pip install newrelic[infinite-tracing] Configuration file (newrelic.ini): distributed_tracing.enabled = true infinite_tracing.trace_observer_host= YOUR_TRACE_OBSERVER_HOST Environment variable: NEW_RELIC_DISTRIBUTED_TRACING_ENABLED=true NEW_RELIC_INFINITE_TRACING_TRACE_OBSERVER_HOST=\"YOUR_TRACE_OBSERVER_HOST\" Ruby Here's an overview of the settings. For more help with configuration, see Ruby agent configuration. Type Required configuration Standard distributed tracing Configuration examples: Configuration file (newrelic.yml): distributed_tracing: enabled: true Environment variable: NEW_RELIC_DISTRIBUTED_TRACING_ENABLED=true Infinite Tracing Configuration examples: Configuration file (newrelic.yml): distributed_tracing: enabled: true infinite_tracing: trace_observer: host: 'YOUR_TRACE_OBSERVER_HOST' Environment variable: NEW_RELIC_DISTRIBUTED_TRACING_ENABLED=true NEW_RELIC_INFINITE_TRACING_TRACE_OBSERVER_HOST=\"YOUR_TRACE_OBSERVER_HOST\" If you need help with proxy configuration, see Proxy support. Step 4. View traces After you configure your APM agents to send data to your trace observer, you're ready to view traces. Here are two alternatives: View traces that include a specific service The explorer helps you navigate to a specific service so you can see traces that include that service. Go to one.newrelic.com. Click Explorer in the top menu bar. Filter to the service you enabled for Infinite Tracing by typing the service name, and then press Enter. In the left navigation's Monitor section, click Distributed tracing. View traces across accounts This option allows you to search all traces across all New Relic accounts in your organization that you have access to. Go to one.newrelic.com. Click Apps in the top menu bar. Under Favorites click Distributed tracing. In the Find traces... search, type a search clause to find the service. For example, to query service.name or trace.id: service.name = YOUR_SERVICE_NAME trace.id = YOUR_TRACE_ID You can also run custom queries and create custom charts of your trace data. See Query trace data. Manual instrumentation (If automatic instrumentation doesn't work) Recommendation: Before performing any custom instrumentation, read: How distributed tracing works Troubleshoot missing data If a service is not passing the trace header to other services, you can use the distributed tracing payload APIs to instrument the calling service and the called service. The calling service uses an API call to generate a payload, which is accepted by the called service. Instrument the calling service To instrument the calling service: Ensure the version of the APM agent that monitors the calling service supports distributed tracing. Invoke the agent API call for generating a distributed trace payload: C SDK | Go | Java | .NET | Node.js | PHP | Python | Ruby. To maintain proper ordering of spans in a trace, ensure you generate the payload in the context of the span that sends it. Add that payload to the call made to the destination service (for example, in a header). (Optional) Identify the call as an external call: C SDK Go Java .NET: n/a Node.js PHP: n/a Python Ruby Instrument the called service To instrument the called service: Ensure the version of the APM agent that monitors the called service supports distributed tracing. If the New Relic agent on the called service does not identify a New Relic transaction, use the agent API to declare a transaction: C SDK One way to tell that a transaction is not in progress: when newrelic_create_distributed_trace_payload() is called, a NULL pointer is returned. To solve this problem, follow the procedures to create a transaction with the C SDK. Go One way to tell that a transaction is not in progress: when Transaction.InsertDistributedTraceHeaders(h http.Header) is called, no headers are inserted. To create a transaction, see Instrument Go transactions. Java One way to tell that a transaction is not in progress: when Transaction.insertDistributedTraceHeaders(Headers) is called, no headers are inserted (this API requires agent 6.4.0+). To create a transaction, see Java agent transaction-related APIs. .NET One way to tell that a transaction is not in progress: CreateDistributedTracePayload() returns an empty payload. To create a transaction, see Introduction to .NET custom instrumentation. Node.js One way to tell that a transaction is not in progress: the Node.js agent logs will report an error similar to this: No transaction found when calling Transaction.acceptDistributedTracePayload. Use startWebTransaction to create a web transaction or startBackgroundTransaction to capture a non-web transaction. PHP One way to tell that a transaction is not in progress: newrelic_insert_distributed_trace_headers() returns false. To create a transaction, see newrelic_start_transaction. Python To tell that a transaction is not in progress: when transaction = current_transaction() is run, transaction is None. Or, if result = accept_distributed_trace_payload(payload) is run, then the result is False. Use background_task to report a non-web transaction. For more on Python instrumentation, see Monitor transactions and segments. Ruby If you are using a Rack-based web framework and have enabled New Relic's Rack instrumentation, the Ruby agent will handle starting a transaction for you. For other use cases, see the add_transaction_tracer API method. Extract the payload from the call that you received (for example, in a header). Invoke the call for accepting the payload: C SDK | Go | Java | .NET | PHP | Node.js | Python | Ruby. For more help If you need more help, check out these support and learning resources: Browse the Explorers Hub to get help from the community and join in discussions. Find answers on our sites and learn how to use our support portal. Run New Relic Diagnostics, our troubleshooting tool for Linux, Windows, and macOS. Review New Relic's data security and licenses documentation.",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 81.27727,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "title": "Language <em>agents</em>: Enable distributed tracing",
        "sections": "Language <em>agents</em>: Enable distributed tracing",
        "info": "How to enable distributed tracing or Infinite Tracing for APM <em>agents</em>.",
        "translation_ja_url": "https:&#x2F;&#x2F;docs.newrelic.co.jp&#x2F;docs&#x2F;understand-dependencies&#x2F;distributed-tracing&#x2F;enable-configure&#x2F;language-<em>agents</em>-enable-distributed-tracing",
        "body": " you find the <em>agent</em> version with the <em>features</em> you want, follow the links for help installing or updating your <em>agent</em>. For best results, update existing <em>agents</em> to the latest version. C SDK Install (compile) or update to the required C SDK version. For best results, update to the latest C SDK version"
      },
      "id": "5eb2c480e7b9d2bc7afa4921"
    },
    {
      "category_2": "Background jobs",
      "nodeid": 2911,
      "sections": [
        "Ruby agent",
        "Getting started",
        "Installation",
        "Configuration",
        "Features",
        "API guides",
        "Instrumented gems",
        "Background jobs",
        "Attributes",
        "Troubleshooting",
        "Monitor Ruby background processes",
        "Supported frameworks",
        "Monitor custom background jobs",
        "Monitor custom background methods",
        "Monitor short-lived processes",
        "Configure newrelic.yml for background processes",
        "Report to an alternate application name",
        "Ensure the agent starts",
        "Monitor scripts",
        "For more help"
      ],
      "title": "Monitor Ruby background processes",
      "category_0": "APM agents",
      "type": "docs",
      "category_1": "Ruby agent",
      "external_id": "cd5e6d055b95a8537279a6f4904bf7565418d6b4",
      "image": "",
      "url": "https://docs.newrelic.com/docs/agents/ruby-agent/background-jobs/monitor-ruby-background-processes",
      "published_at": "2021-02-22T22:10:08Z",
      "updated_at": "2021-01-31T10:23:46Z",
      "breadcrumb": "Contents / APM agents / Ruby agent / Background jobs",
      "document_type": "page",
      "popularity": 1,
      "info": "How to configure New Relic's Ruby agent to instrument background jobs.",
      "body": "Our Ruby agent automatically instruments several common background job frameworks. You can also customize it to trace any background tasks. Data from background jobs appears in the Transactions page in APM as Non-web transactions. Supported frameworks The following background job frameworks are supported by default in recent versions of the Ruby agent: Resque instrumentation (Ruby agent 3.4.0) Sidekiq instrumentation (Ruby agent 3.6.0) Delayed::Job instrumentation (Ruby agent 2.10) JRuby users may see issues with CPU metrics. If you are using these frameworks, monitoring background jobs typically doesn't require additional configuration. Monitor custom background jobs You can instrument custom background jobs to appear in the APM Transactions page as Non-web transactions. To monitor Non-web transactions while using an unsupported framework, you must add custom instrumentation. As an example, a background job periodically runs a task called SalesOrganization#find_new_leads. Add the ControllerInstrumentation module. Use the add_transaction_tracer directive below the method definition Add :category => :task to tell the agent this trace is a Non-web transaction. require 'newrelic_rpm' class SalesOrganization include ::NewRelic::Agent::Instrumentation::ControllerInstrumentation def find_new_leads ... end add_transaction_tracer :find_new_leads, :category => :task end You can pass a string to the :category, but values will only appear on the APM Transactions page if the string begins with OtherTransaction/. Monitor custom background methods Using the Ruby agent API, you can designate specific methods to trace the Non-web transactions. This gathers traces for slow running jobs and associates captured errors to transactions. To instrument a class method, use the class singleton. As an example, a background job periodically runs a task called SalesOrganization#find_new_leads. Add the ControllerInstrumentation module below the method definition. Use the add_transaction_tracer directive Add :category => :task to tell the agent this trace is a Non-web transaction. require 'newrelic_rpm' class SalesOrganization def self.find_new_leads ... end class << self include ::NewRelic::Agent::Instrumentation::ControllerInstrumentation add_transaction_tracer :find_new_leads, :category => :task end end For more information, see Ruby custom metrics. Monitor short-lived processes Make sure the process isn't running before the agent connects to the back-end servers. To do so, make the Ruby agent synchronously connect to New Relic, rather than the default asynchronous behavior. Use manual_start and pass in the :sync_startup => true option: require 'new_relic/agent' NewRelic::Agent.manual_start(:sync_startup => true) Using require 'new_relic/agent' will require the agent's code, and it will make sure the agent doesn't run until you manually start it. If the process is shorter than the agent harvest cycle, you need to manually shut down the agent with ::NewRelic::Agents.shutdown to ensure all queued data is sent. Configure newrelic.yml for background processes Configuring your newrelic.yml depends on the context of the background application. Non-Rails background application If your background app is non-Rails application already running the Ruby agent, copy your newrelic.yml file to the directory where you launch the background job or in the config subdirectory. Make sure it includes your license key. Background jobs that do not run in a Rails context will examine the NEW_RELIC_ENV environment variable to determine which section of the configuration file to read, falling back to the RUBY_ENV, RAILS_ENV, and RACK_ENV environment variables in sequence, and finally defaulting to development if none of these environment variables are set. Background job environment monitored by New Relic If your background job runs in the context of an existing web application that is already monitored with New Relic, the Ruby agent will automatically pick up your existing newrelic.yml file. Background jobs that boot your application's Rails environment will use the RAILS_ENV environment variable in order to determine which section of the newrelic.yml file to read. Report to an alternate application name You can make jobs that run in the context of an existing New Relic web application appear under a different application name in the APM UI. Begin before newrelic_rpm gets required by your worker code. Set the NEW_RELIC_APP_NAME environment variable to the application name to use for your background jobs when starting your background worker processes. This will override the app_name setting in your newrelic.yml. $ NEW_RELIC_APP_NAME=\"My Background Jobs\" ./bin/my_background_worker.rb Ensure the agent starts The Ruby agent will automatically start in most cases as soon as you require 'newrelic_rpm', unless the agent detects a blacklisted executable name, rake task name, or constant. This prevents it from starting during common rake tasks and interactive console sessions. Non-Rails standalone script Standalone scripts running without Rails generally will start the agent as soon as they require 'newrelic_rpm'. If you have a script that forks or daemonizes before it begins its main work, you may want to defer this require call until after the initial setup finishes. Background tasks with daemons gem If you use the daemons gem to start background tasks, the Ruby agent may fail to start and also not emit any logging. This happens because the daemons gem changes the working directory to / before executing your background code. The agent then attempts to resolve the paths to its configuration file and log file relative to the current working directory of the host process. To allow the agent to start in this situation, set environment variables with the locations of the agent configuration file and log file; for example: ENV['NRCONFIG'] ||= File.dirname(__FILE__) + '/../../config/newrelic.yml' ENV['NEW_RELIC_LOG'] ||= File.dirname(__FILE__) + '/../../log/newrelic_agent.log' For more information, see the documentation about controlling agent startup Monitor scripts The agent startup instructions apply when running background jobs in a daemon. If a script executes a single background task and exits, manually shut down the agent with ::NewRelic::Agents.shutdown when the script finishes. This ensures the New Relic collector receives the data. For example: require 'newrelic_rpm' class SalesOrganization include ::NewRelic::Agent::Instrumentation::ControllerInstrumentation def find_new_leads ... end add_transaction_tracer :find_new_leads, :category => :task end SalesOrganization.new.find_new_leads ::NewRelic::Agent.shutdown For more help Additional documentation resources include: Ruby custom metrics (method tracers, metric names, stats, examples Ruby agent API (public API methods for the New Relic Ruby agent) If you need more help, check out these support and learning resources: Browse the Explorers Hub to get help from the community and join in discussions. Find answers on our sites and learn how to use our support portal. Run New Relic Diagnostics, our troubleshooting tool for Linux, Windows, and macOS. Review New Relic's data security and licenses documentation.",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 78.0923,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "title": "Monitor <em>Ruby</em> background processes",
        "sections": "<em>Ruby</em> <em>agent</em>",
        "info": "How to configure New Relic&#x27;s <em>Ruby</em> <em>agent</em> to instrument background jobs.",
        "category_0": "APM <em>agents</em>",
        "category_1": "<em>Ruby</em> <em>agent</em>",
        "body": "::<em>Agents</em>.shutdown to ensure all queued data is sent. Configure newrelic.yml for background processes Configuring your newrelic.yml depends on the context of the background application. Non-Rails background application If your background app is non-Rails application already running the <em>Ruby</em> <em>agent</em>, copy your",
        "breadcrumb": "Contents &#x2F; APM <em>agents</em> &#x2F; <em>Ruby</em> <em>agent</em> &#x2F; Background jobs"
      },
      "id": "58819a178e9c0f5677ab3947"
    }
  ],
  "/docs/integrations/kubernetes-integration/understand-use-data/kubernetes-cluster-explorer": [
    {
      "category_2": "Get started",
      "nodeid": 39376,
      "sections": [
        "Observe everything",
        "Get started",
        "Observability solutions",
        "Get started with Full-Stack Observability",
        "You’re in control because you understand your system",
        "All the answers in one place",
        "Start anywhere",
        "For more help"
      ],
      "title": "Get started with Full-Stack Observability",
      "category_0": "Full-Stack Observability",
      "type": "docs",
      "category_1": "Observe everything",
      "translation_ja_url": "https://docs.newrelic.co.jp/docs/full-stack-observability/observe-everything/get-started/get-started-full-stack-observability",
      "external_id": "c462cd451cb9f51722f1370c6b8df3932d38a4e3",
      "image": "",
      "url": "https://docs.newrelic.com/docs/full-stack-observability/observe-everything/get-started/get-started-full-stack-observability",
      "published_at": "2021-02-24T05:33:46Z",
      "updated_at": "2021-02-24T05:33:46Z",
      "breadcrumb": "Contents / Full-Stack Observability / Observe everything / Get started",
      "document_type": "page",
      "popularity": 1,
      "info": "New Relic can help you achieve full-stack observability throughout your estate. See all the possibilities.",
      "body": "Full-Stack Observability is the power of knowing what is happening in your digital system and why, at any time, whatever solution you’re using. It’s getting the whole picture of everything that enables your applications and devices to deliver value to your customers, from the container running a microservice in the cloud to a mobile website's shopping cart button. To use Full-Stack Observability and the rest of our observability platform, join the New Relic family! Sign up to create your free account in only a few seconds. Then ingest up to 100GB of data for free each month. Forever. You’re in control because you understand your system New Relic helps you cut through the layers of complexity surrounding your systems by bringing together and connecting data from any instrumented source and environment, without having to jump between tools. You can interrogate your data for patterns, discover them using our data platform, or get proactive results from our machine learning tools. New Relic provides answers to essential questions in one place. All the answers in one place As a full user you get access to our entire set of observability tools. All our tools are interconnected and accessible in New Relic One. All the data you bring to New Relic through agents and integrations are metrics, events, logs, and traces that feed our platform's analytics and monitoring capabilities. New Relic links your data in a meaningful way so that you can explore it, build dashboards, and set up alerts. Full-Stack Observability curated experiences allow to visualize, analyze, and troubleshoot your entire software stack in one unified platform. The New Relic Explorer consolidates all the entities in your system, and how they're connected, in a single place, so you can easily detect performance trends and issues. By automatically connecting infrastructure health with application performance and end-user behavior, you can cut through the noise to find the signal. Start anywhere Being fully-connected, New Relic allows you to start your observability journey from any element of your stack. For example, you can get to crucial infrastructure logs from traces of an application running on a problematic Kubernetes pod. &nbsp The more entities you instrument, the more data you'll bring in. The more data you've brought to New Relic, the more you'll understand your metrics, events, logs, and traces. You want to instrument Start with Keep exploring Front-end applications Mobile applications User behavior and flows New Relic Explorer Browser monitoring Mobile monitoring Synthetic monitoring Single page monitoring Scripted browsers Containerized minions Workloads Backend applications Serverless applications New Relic Explorer Application monitoring Serverless monitoring Learning about Apdex Distributed tracing Logs in context APM data to infrastructure Workloads Infrastructure hosts and services (on-premise, cloud, orchestrated) Container environments and orchestration tools (Kubernetes, ECS, etc.) Infrastructure monitoring Infrastructure integrations Kubernetes integration Docker integration ECS integration Log forwarding APM data to infrastructure Custom integrations Kubernetes cluster explorer Infrastructure alerts Workloads For more help If you need more help, check out these support and learning resources: Browse the Explorers Hub to get help from the community and join in discussions. Find answers on our sites and learn how to use our support portal. Run New Relic Diagnostics, our troubleshooting tool for Linux, Windows, and macOS. Review New Relic's data security and licenses documentation.",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 104.49754,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "sections": "You’re in control because you <em>understand</em> your system",
        "body": " (<em>Kubernetes</em>, ECS, etc.) Infrastructure monitoring Infrastructure <em>integrations</em> <em>Kubernetes</em> <em>integration</em> Docker <em>integration</em> ECS <em>integration</em> Log forwarding APM <em>data</em> to infrastructure Custom <em>integrations</em> <em>Kubernetes</em> cluster explorer Infrastructure alerts Workloads For more help If you need more help, check out"
      },
      "id": "6035e53ae7b9d20cf92a07d6"
    },
    {
      "category_2": "Installation",
      "nodeid": 14966,
      "sections": [
        "Kubernetes integration",
        "Get started",
        "Installation",
        "Understand and use data",
        "Link apps and services",
        "Kubernetes events",
        "Logs",
        "Troubleshooting",
        "Kubernetes integration: install and configure",
        "Use automated installer",
        "Installs for managed services and platforms",
        "Custom manifest",
        "Make sure New Relic pods can be scheduled",
        "Unprivileged installs of the Kubernetes integration",
        "Configure the integration",
        "Configure the infrastructure agent",
        "Update to the latest version",
        "Uninstall the Kubernetes integration",
        "For more help"
      ],
      "title": "Kubernetes integration: install and configure",
      "category_0": "Integrations",
      "type": "docs",
      "category_1": "Kubernetes integration",
      "translation_ja_url": "https://docs.newrelic.co.jp/docs/integrations/kubernetes-integration/installation/kubernetes-integration-install-configure",
      "external_id": "e2a0aea9a0c2461e833148e95859ee34f03bce95",
      "image": "https://docs.newrelic.com/sites/default/files/thumbnails/image/cke.jpeg",
      "url": "https://docs.newrelic.com/docs/integrations/kubernetes-integration/installation/kubernetes-integration-install-configure",
      "published_at": "2021-02-23T09:03:16Z",
      "updated_at": "2021-02-23T09:03:15Z",
      "breadcrumb": "Contents / Integrations / Kubernetes integration / Installation",
      "document_type": "page",
      "popularity": 1,
      "info": "New Relic's Kubernetes integration: How to install and activate the integration, and what data is reported.",
      "body": "The easiest way to install the Kubernetes integration is to use our automated installer to generate a manifest. It bundles not just the integration DaemonSets, but also other New Relic Kubernetes configurations, like Kubernetes events, Prometheus OpenMetrics, and New Relic log monitoring. To use Kubernetes integrations and infrastructure monitoring, as well as the rest of our observability platform, join the New Relic family! Sign up to create your free account in only a few seconds. Then ingest up to 100GB of data for free each month. Forever. Use automated installer You can use the automated installer for servers, VMs, and unprivileged environments. The installer can also help you with managed services or platforms after you review a few preliminary notes. We also have separate instructions if you need a custom manifest or prefer to do a manual unprivileged installation. Start the installer If your New Relic account is in the EU region, access the installer from one.eu.newrelic.com. Installs for managed services and platforms Before starting our automated installer, check out these notes for your managed services or platforms: Amazon EKS The Kubernetes integration monitors worker nodes. In Amazon EKS, master nodes are managed by Amazon and abstracted from the Kubernetes platforms. Before starting our automated installer to deploy the Kubernetes integration in Amazon EKS, make sure you are using the version of kubectl provided by AWS. Google Kubernetes Engine (GKE) The Kubernetes integration monitors worker nodes. In GKE, master nodes are managed by Google and abstracted from the Kubernetes platforms. Before starting our automated installer to deploy the Kubernetes integration on GKE, ensure you have sufficient permissions: Go to https://console.cloud.google.com/iam-admin/iam and find your username. Click edit. Ensure you have permissions to create Roles and ClusterRoles: If you are not sure, add the Kubernetes Engine Cluster Admin role. If you cannot edit your user role, ask the owner of the GCP project to give you the necessary permissions. Ensure you have a RoleBinding that grants you the same permissions to create Roles and ClusterRoles: kubectl create clusterrolebinding YOUR_USERNAME-cluster-admin-binding --clusterrole=cluster-admin --user=YOUR_GCP_EMAIL Creating a RoleBinding is necessary because of a known RBAC issue in Kubernetes and Kubernetes Engine versions 1.6 or higher. For more information, see Google Cloud's documentation on defining permissions in a role. OpenShift container platform To deploy the Kubernetes integration with OpenShift: Add the <release_name>-newrelic-infrastructure service account to your privileged Security Context Constraints: oc adm policy add-scc-to-user privileged \\ system:serviceaccount: <namespace> :<release_name>-newrelic-infrastructure The default <release_name> provided by the installer is nri-bundle. Complete the steps in our automated installer. If you're using signed certificates, make sure they are properly configured by using the following variables in the DaemonSet portion of your manifest to set the .pem file: - name: NRIA_CA_BUNDLE_DIR value: YOUR_CA_BUNDLE_DIR - name: NRIA_CA_BUNDLE_FILE value: YOUR_CA_BUNDLE_NAME YAML key path: spec.template.spec.containers.name.env Save your changes. Azure Kubernetes Service (AKS) The Kubernetes integration monitors worker nodes. In Azure Kubernetes Service, master nodes are managed by Azure and abstracted from the Kubernetes platforms. To deploy in Azure Kubernetes Service (AKS), complete the steps in our automated installer. Pivotal Container Service (PKS / VMware Tanzu) To deploy in PKS, we recommend that you use the automated installer, or you can follow the manual instructions provided in Install the Kubernetes integration using Helm. Custom manifest If the Kubernetes automated installer doesn't provide the settings you need, you can download our manifest template and install the integration manually. To activate the Kubernetes integration, you must deploy the newrelic-infra agent onto a Kubernetes cluster as a DaemonSet: Install kube-state-metrics and get it running on the cluster. For example: curl -L -o kube-state-metrics- 1.9.5 .zip https://github.com/kubernetes/kube-state-metrics/archive/v 1.9.5 .zip && unzip kube-state-metrics- 1.9.5 .zip && kubectl apply -f kube-state-metrics- 1.9.5 /examples/standard Download the manifest file: curl -O https://download.newrelic.com/infrastructure_agent/integrations/kubernetes/newrelic-infrastructure-k8s-latest.yaml In the DaemonSet portion of your manifest, add your New Relic license key and a cluster name to identify your Kubernetes cluster. Both values are required. Recommendation: Do not change the NRIA_PASSTHROUGH_ENVIRONMENT or NRIA_DISPLAY_NAME value in your manifest. YOUR_CLUSTER_NAME is your cluster’s id in New Relic’s entity explorer. It doesn’t need to match the name of the cluster running in your environment. YAML key path: spec.template.spec.containers.name.env env: - name: NRIA_LICENSE_KEY value: YOUR_LICENSE_KEY - name: CLUSTER_NAME value: YOUR_CLUSTER_NAME If you need to adapt the manifest to fit your environment, review the configure section in this doc. Confirm that kube-state-metrics is installed. kubectl get pods --all-namespaces | grep kube-state-metrics Create the DaemonSet: kubectl create -f newrelic-infrastructure-k8s-latest.yaml Confirm that the DaemonSet has been created successfully by looking for newrelic-infra in the results generated by this command: kubectl get daemonsets To confirm that the integration is working: wait a few minutes, then look for data in the New Relic Kubernetes cluster explorer. If you don't see data, review the configuration procedures again, then follow the troubleshooting procedures. In the future, the number of labels collected on Kubernetes objects will be limited per object type (containers, pods, nodes, etc.). If objects have labels above the limit, you will be able to configure important labels that should always be sent to New Relic. When the limitation is in place, this documentation will be updated. Make sure New Relic pods can be scheduled Some of the New Relic pods are set up as DaemonSet in the manifest file so that they can run on every host. These include newrelic-infrastructure and newrelic-logging. In rare circumstances, other pods may be scheduled first and starve the New Relic pods of resources. Since each of these pods have to run on a specific host, they will stay in pending status until that host has enough resources, even if there are other hosts available. This could end up occurring for long periods of time and result in reporting gaps. To prevent this scenario, you can configure the Kubernetes scheduler to give New Relic pods a higher priority. Using the default scheduler: Ensure kube-scheduler flag disablePreemption is not set to true (by default it is false). Create a PriorityClass for the New Relic DaemonSet pods: Set the appropriate priority value, which should generally be higher than your other pods. preemptionPolicy is set to PreemptLowerPriority by default. This allows New Relic pods assigned this priority class to remove lower-priority pods that are taking up resources. Edit the manifest file to add priorityClassName to any DaemonSet specs. In the example below, the highlighted line sets the priority class for newrelic-infrastructure: apiVersion: apps/v1 kind: DaemonSet metadata: namespace: default labels: app: newrelic-infrastructure chart: newrelic-infrastructure-1.0.0 release: nri-bundle mode: privileged name: nri-bundle-newrelic-infrastructure spec: priorityClassName: your-priority-class ... If you have already deployed the New Relic pods, re-deploy them and confirm they have been created: kubectl delete -f newrelic-infrastructure-k8s-latest.yaml kubectl create -f newrelic-infrastructure-k8s-latest.yaml kubectl get daemonsets Unprivileged installs of the Kubernetes integration For platforms that have stringent security requirements, we provide an unprivileged version of the Kubernetes integration. Changes from the standard Kubernetes integration are: Runs the infrastructure agent and the Kubernetes integration as a standard user instead of root No access to the underlying host filesystem No access to /var/run/docker.sock Container's root filesystem mounted as read-only allowPrivilegeEscalation is set to false hostnetwork is set to false The tradeoff is that the solution will only collect metrics from Kubernetes, but it will not collect any metric from the underlying hosts directly. Kubernetes provides some data (metrics and metadata) about its nodes (hosts). Optional: To collect the underlying host metrics, the non-containerized infrastructure agent can be deployed on the underlying host. The infrastructure agent already supports running as non-root. The combination of the Kubernetes integration in its unprivileged version and the agent running on the host will report all the metrics that our standard solution for monitoring Kubernetes receives. Steps to complete an unprivileged install Install kube-state-metrics and get it running on the cluster. For example: curl -L -o kube-state-metrics- 1.9.5 .zip https://github.com/kubernetes/kube-state-metrics/archive/v 1.9.5 .zip && unzip kube-state-metrics- 1.9.5 .zip && kubectl apply -f kube-state-metrics- 1.9.5 /examples/standard Download the integration manifest: curl -O https://download.newrelic.com/infrastructure_agent/integrations/kubernetes/newrelic-infrastructure-k8s-unprivileged-latest.yaml In the manifest, add your New Relic license key and a cluster name to identify your Kubernetes cluster. Both values are required. YOUR_CLUSTER_NAME is your cluster’s id in New Relic’s entity explorer. It doesn’t need to match the name of the cluster running in your environment. env: - name: NRIA_LICENSE_KEY value: YOUR_LICENSE_KEY - name: CLUSTER_NAME value: YOUR_CLUSTER_NAME YAML key path: spec.template.spec.containers.name.env Confirm that kube-state-metrics is installed. kubectl get pods --all-namespaces | grep kube-state-metrics Create the DaemonSet: kubectl create -f newrelic-infrastructure-k8s-unprivileged-latest.yaml Confirm that the DaemonSet has been created successfully by looking for newrelic-infra in the results generated by this command: kubectl get daemonsets To confirm that the integration has been configured correctly, wait a few minutes, then run this NRQL query to see if data has been reported: SELECT * FROM K8sPodSample since 5 minutes ago Configure the integration The Kubernetes integration comes with a default configuration that should work in most environments. To change the configuration, modify the manifest file: Select which processes should send their data to New Relic By default, data about the processes running on your pods is not sent to New Relic. You can enable it by setting enable_process_metrics to true. To choose what metric data you want to send to New Relic, configure the include_matching_metrics environment variable in your manifest. Specify the Kubernetes API host and port This is necessary when you are using SSL and not using the default FQDN. The Kubernetes API FQDN needs to match the FQDN of the SSL certificate. You do not need to specify both variables. For example, if you only specify the HOST, the default PORT will be used. - name: \"KUBERNETES_SERVICE_HOST\" value: \"KUBERNETES_API_HOST\" - name: \"KUBERNETES_SERVICE_PORT\" value: \"KUBERNETES_API_TCP_PORT\" Kubernetes versions 1.6 to 1.7.5: Edit manifest file For Kubernetes versions 1.6 to 1.7.5, uncomment these two lines in the manifest file: - name: \"CADVISOR_PORT\" # Enable direct connection to cAdvisor by specifying the port. Needed for Kubernetes versions prior to 1.7.6. value: \"4194\" Use environment variables Use environment variables that can be passed to the Kubernetes integration if you use a proxy to configure its URL. Disable kube-state-metrics parsing You can disable kube-state-metrics parsing for the DaemonSet by using the following configuration: - name: \"DISABLE_KUBE_STATE_METRICS\" value: \"true\" Disabling kube-state-metrics also disables data collection for the following: ReplicaSets DaemonSets StatefulSets Namespaces Deployments Services Endpoints Pods (that are pending) Additionally, disabling this affects the Kubernetes Cluster Explorer in the following ways: No pending pods are shown. No filters based on services. Specify the kube-state-metrics URL If several instances of kube-state-metrics are present in the cluster, uncomment and configure the following lines to specify which one to use: - name: \"KUBE_STATE_METRICS_URL\" value: \"http://KUBE_STATE_METRICS_IP_OR_FQDN:PORT\" Even though a KUBE_STATE_METRICS_URL is defined, the KSM service should contain one of the following labels for the auto-discovery process: k8s-app=kube-state-metrics OR app=kube-state-metrics OR ​​app.kubernetes.io/name=kube-state-metrics This configuration option overrides KUBE_STATE_METRICS_POD_LABEL. If you have both defined, KUBE_STATE_METRICS_POD_LABEL has no effect. Discover kube-state-metrics pods using a label If several instances of kube-state-metrics are present in the cluster, another option to easily target one of these instances with the Kubernetes integration is to use label-based discovery. - name: \"KUBE_STATE_METRICS_POD_LABEL\" value: \"LABEL_NAME\" When a KUBE_STATE_METRICS_POD_LABEL is defined, the label should have a value equal to true. For example, if the label name is my-ksm, ensure that my-ksm=true. This configuration option is incompatible with KUBE_STATE_METRICS_URL. If you have both defined, KUBE_STATE_METRICS_URL is used. Query kube-state-metrics behind RBAC If your instance of kube-state-metrics is behind kube-rbac-proxy, the integration can be configured in a compatible way using the combination of the label-based discovery and two other environment variables: - name: \"KUBE_STATE_METRICS_SCHEME\" value: \"https\" - name: \"KUBE_STATE_METRICS_PORT\" value: \"KSM_RBAC_PROXY_PORT\" To confirm which port should be used as the value of KUBE_STATE_METRICS_PORT, we recommend running a describe command on the kube-state-metrics pod and look for the port exposed by the container named kube-rbac-proxy-main. These two configuration options only work when using the KUBE_STATE_METRICS_POD_LABEL ​configuration described above. kube-state-metrics timeout: Increase the client timeout To increase the client timeout of kube-state-metrics, add a new environment variable, TIMEOUT, to the manifest file: env: - name: TIMEOUT value: 5000 # The default client timeout when calling kube-state-metrics, in milliseconds Then, add this new environment variable to the NRIA_PASSTHROUGH_ENVIRONMENT Non-default namespace deployments: Edit config file If you want to deploy in a different namespace from default, change all values of namespace in the manifest. Set the TTL for the Kubernetes API responses cache By default, the integration will cache any retrieved information from the Kubernetes API for 5 minutes. Use the API_SERVER_CACHE_TTL environment variable to set a custom cache duration for responses from the API server. Valid time unit values are: ns, us, ms, s, m, and h. To disable caching, set to 0s. env: - name: API_SERVER_CACHE_TTL value: \"1m\" Specify base URLs for control plane component endpoints Use the following environment variables if any of the Kubernetes control plane components export metrics on base URLs that are different from the defaults. This is necessary for environments such as OpenShift when a control plane component metrics endpoint is using SSL or an alternate port. Values of these environment variables must be base URLs of the form [scheme]://[host]:[port]. URLs should not include a path component. For example: - name: \"SCHEDULER_ENDPOINT_URL\" value: \"https://localhost:10259\" - name: \"ETCD_ENDPOINT_URL\" value: \"https://localhost:9979\" - name: \"CONTROLLER_MANAGER_ENDPOINT_URL\" value: \"https://localhost:10257\" - name: \"API_SERVER_ENDPOINT_URL\" value: \"https://localhost:6443\" The /metrics path segment is added automatically. In addition, if the https scheme is used, authentication to the control plane component pod(s) is accomplished via service accounts. If a FQDN (fully qualified domain name) is used in a multi-master cluster, inconsistent results may be returned. Therefore, it is recommended to use localhost only. Even though a custom base URL is defined for a given control plane component, the control plane component pod(s) must contain one of the labels supported by the auto-discovery process. Even though a custom ETCD_ENDPOINT_URL can be defined, ETCD will always require https and mTLS authentication to be configured. Here are some additional configurations to consider: Do more configuration for control plane monitoring Link New Relic APM to the Kubernetes integration Monitor services that run on Kubernetes Configure the infrastructure agent The Kubernetes integration image comes with a default configurations for the agent that can be modified if needed. When installing with the manifest, you can modify the infrastructure agent configuration by editing the manifest and adding any needed configuration option of the agent as environment variables of the newrelic-infrastructure DaemonSet. When installing with Helm, you can specify the needed infrastructure agent configuration options in the values.yaml as shown in the example in GitHub. The config object is used to populate the configMap that is mounted automatically in the location of the infrastructure agent configuration file in the pods created by the newrelic-infrastructure DaemonSet. Update to the latest version If you are already running the Kubernetes integration and want to update the newrelic-infra agent to the latest agent version: Run this NRQL query to check which version you are currently running (this will return the image name by cluster): SELECT latest(containerImage) FROM K8sContainerSample WHERE containerImage LIKE '%newrelic/infrastructure%' FACET clusterName SINCE 1 day ago If you've set a name other than newrelic/infrastructure for the integration's container image, the above query won't yield results: to make it work, edit the name in the query. Download the integration manifest file: curl -O https://download.newrelic.com/infrastructure_agent/integrations/kubernetes/newrelic-infrastructure-k8s-latest.yaml Copy the changes you made to the manifest. At a minimum, include CLUSTER_NAME and NRIA_LICENSE_KEY, and paste your changes in the manifest you downloaded. Install the latest DaemonSet with the following command (Kubernetes will automatically do a rollout upgrade for the integration's pods): kubectl apply -f newrelic-infrastructure-k8s-latest.yaml Uninstall the Kubernetes integration To uninstall the Kubernetes integration: Verify that newrelic-infrastructure-k8s-latest.yaml corresponds to the filename of the manifest as you have saved it. Example: If you are using the unprivileged version of the integration, the default filename will be newrelic-infrastructure-k8s-unprivileged-latest.yaml. After you verify the filename, use the following command: kubectl delete -f newrelic-infrastructure-k8s-latest.yaml You only need to execute this command once, regardless of the number of nodes in your cluster. For more help If you need more help, check out these support and learning resources: Browse the Explorers Hub to get help from the community and join in discussions. Find answers on our sites and learn how to use our support portal. Run New Relic Diagnostics, our troubleshooting tool for Linux, Windows, and macOS. Review New Relic's data security and licenses documentation.",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 103.14933,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "title": "<em>Kubernetes</em> <em>integration</em>: install <em>and</em> configure",
        "sections": "<em>Kubernetes</em> <em>integration</em>: install <em>and</em> configure",
        "info": "New Relic&#x27;s <em>Kubernetes</em> <em>integration</em>: How to install <em>and</em> activate the <em>integration</em>, <em>and</em> what <em>data</em> is reported.",
        "category_0": "<em>Integrations</em>",
        "category_1": "<em>Kubernetes</em> <em>integration</em>",
        "translation_ja_url": "https:&#x2F;&#x2F;docs.newrelic.co.jp&#x2F;docs&#x2F;<em>integrations</em>&#x2F;<em>kubernetes</em>-<em>integration</em>&#x2F;installation&#x2F;<em>kubernetes</em>-<em>integration</em>-install-configure",
        "body": " <em>Kubernetes</em> <em>integrations</em> and infrastructure monitoring, as well as the rest of our observability platform, join the New Relic family! Sign up to create your free account in only a few seconds. Then ingest up to 100GB of <em>data</em> for free each month. Forever. <em>Use</em> automated installer You can <em>use</em>",
        "breadcrumb": "Contents &#x2F; <em>Integrations</em> &#x2F; <em>Kubernetes</em> <em>integration</em> &#x2F; Installation"
      },
      "id": "5efd3b2e64441fd60f5f7e49"
    },
    {
      "category_2": "Kubernetes integration release notes",
      "nodeid": 42606,
      "sections": [
        "Infrastructure agent release notes",
        "Cloud integration release notes",
        "Kubernetes integration release notes",
        "Deprecation notice: Kubernetes v1.7 or lower",
        "Background",
        "What is happening?",
        "What do you need to do?",
        "What happens if you don’t make any changes to your account?"
      ],
      "title": "Deprecation notice: Kubernetes v1.7 or lower",
      "category_0": "Release notes",
      "type": "docs",
      "category_1": "Infrastructure agent release notes",
      "external_id": "fb62db029b2eded23abb1230392a3aa6860d497c",
      "image": "",
      "url": "https://docs.newrelic.com/docs/release-notes/infrastructure-release-notes/kubernetes-integration-release-notes/deprecation-notice-kubernetes-v17-or-lower",
      "published_at": "2021-02-23T07:46:06Z",
      "updated_at": "2021-02-15T17:30:23Z",
      "breadcrumb": "Contents / Release notes / Infrastructure agent release notes / Kubernetes integration release notes",
      "document_type": "release_notes",
      "popularity": -2,
      "body": "[RSS] Released on:  Friday, May 15, 2020 - 16:03 Effective Wednesday, 12 August 2020, Kubernetes integration v1.7 or lower will be deprecated. To avoid losing data, upgrade to the latest version. For more information, read this note or contact your account team. Background In order to provide the best possible experience for monitoring Kubernetes, we are merging the Kubernetes Cluster Explorer into New Relic One, where you’ll enjoy all the latest features. What is happening? We will support Kubernetes integrations v1.7 or lower until Wednesday, 12 August 2020. Starting on July 1st the Kubernetes Cluster Explorer will only be available at one.newrelic.com > Kubernetes Cluster Explorer. The Kubernetes Cluster Explorer will only be compatible with Kubernetes integrations v.1.8 and newer from Wednesday, August 12th. Therefore in order to enjoy the latest features and to be fully compatible with the New Relic One Kubernetes Cluster Explorer, you must upgrade your Kubernetes integration to the latest version. What do you need to do? Follow the instructions here to upgrade to the latest version of the Kubernetes integration. What happens if you don’t make any changes to your account? The Kubernetes integration will still send data to the New Relic platform, though the Kubernetes Cluster Explorer in New Relic One will not work for Clusters running Kubernetes integration versions v1.7 or older after Wednesday, 12 August. In other words, the integration will still send data, however you will be unable to view that data in the Cluster Explorer.",
      "info": "",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 97.795395,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "title": "Deprecation notice: <em>Kubernetes</em> v1.7 or lower",
        "sections": "<em>Kubernetes</em> <em>integration</em> release notes",
        "category_2": "<em>Kubernetes</em> <em>integration</em> release notes",
        "body": "[RSS] Released on:  Friday, May 15, 2020 - 16:03 Effective Wednesday, 12 August 2020, <em>Kubernetes</em> <em>integration</em> v1.7 or lower will be deprecated. To avoid losing <em>data</em>, upgrade to the latest version. For more information, read this note or contact your account team. Background In order to provide",
        "breadcrumb": "Contents &#x2F; Release notes &#x2F; Infrastructure agent release notes &#x2F; <em>Kubernetes</em> <em>integration</em> release notes"
      },
      "id": "602aafaf196a67232a405a7c"
    },
    {
      "nodeid": 9921,
      "sections": [
        "Install and configure the infrastructure agent",
        "Get started",
        "Linux installation",
        "Windows installation",
        "Config management tools",
        "Configuration",
        "Update or uninstall",
        "Manage your agent",
        "Requirements for the infrastructure agent",
        "Processor architectures",
        "Operating systems",
        "Unique hostname",
        "Permissions",
        "Libraries",
        "Network access",
        "Container software",
        "CPU, memory, and disk usage",
        "Configuration management tools",
        "For more help"
      ],
      "title": "Requirements for the infrastructure agent",
      "category_0": "Infrastructure monitoring",
      "type": "docs",
      "category_1": "Install and configure the infrastructure agent",
      "translation_ja_url": "https://docs.newrelic.co.jp/docs/infrastructure/install-infrastructure-agent/get-started/requirements-infrastructure-agent",
      "external_id": "71d7349826202468aec8827527896e9bd07d0b2b",
      "image": "https://docs.newrelic.com/sites/default/files/thumbnails/image/amazon%20linux.png",
      "url": "https://docs.newrelic.com/docs/infrastructure/install-infrastructure-agent/get-started/requirements-infrastructure-agent",
      "published_at": "2021-02-23T09:31:50Z",
      "updated_at": "2021-02-23T09:31:50Z",
      "breadcrumb": "Contents / Infrastructure monitoring / Install and configure the infrastructure agent / Get started",
      "document_type": "page",
      "popularity": 1,
      "info": "Compatibility information for infrastructure monitoring, including supported Linux and Windows versions.",
      "body": "Before installing our infrastructure agent, make sure your system and any on-host integrations you configure meet the requirements. Processor architectures The infrastructure agent supports only x86 processor architectures: Linux: 64-bit architecture (also requires 64-bit package manager and dependencies) Windows: both 32 and 64-bit architectures ARM: AWS Graviton 2 processor (using the tarball setup instructions). Support is limited to infrastructure monitoring. Integrations, such as log forwarding, may not work as expected. Operating systems The infrastructure agent supports these operating systems: Operating system Supported by the infrastructure agent Amazon Linux All versions CentOS Version 7 or higher Debian Version 8 (\"Jessie\") or higher Docker Docker 1.12 Kubernetes Tested with versions 1.10 to 1.16 Red Hat Enterprise Linux (RHEL) Version 6 or higher SUSE Linux Enterprise Server (SLES) Versions 11.4, 12.1, 12.2, 12.3, and 12.4 Ubuntu LTS versions 14.04.x, 16.04.x, 18.04.x, 20.04.x Windows Windows Server 2012, 2016, and 2019, and their service packs. Windows 10 (only the infrastructure agent is supported). Operating systems are not supported beyond end-of-life. You can monitor Amazon BottleRocket workloads: When running EC2 instances, use the containerized agent. On EKS, install the Kubernetes integration. For ECS clusters, deploy the ECS integration. Unique hostname The infrastructure agent uses the hostname to uniquely identify each server. To avoid inaccurate metrics from combining multiple servers under a single hostname, make sure that each monitored server has a unique hostname. You can use the optional display_name setting to override the default hostname. Servers named localhost are not reported: it's a default name and inherently non-unique. Permissions The infrastructure agent requires these permissions: Linux: By default, the agent runs and installs as root. You can also select privileged or unprivileged run modes. Windows: The agent must be installed from an Administrator account and requires Administrator privileges to run. Libraries For agent versions 1.1.19 or higher, you need the libcap library in order to install Infrastructure. It's available in the official repositories of your distribution. Network access In order to report data to New Relic, our infrastructure agent must have outbound access to certain domains and ports. If your system needs a proxy to connect to these domains, use the proxy setting. Container software The infrastructure agent instruments Docker containers when installed on the host server. We support Docker versions 1.12 or higher. CPU, memory, and disk usage The infrastructure agent is fairly lightweight. For typical CPU, memory, and disk usage, see our page on agent performance overhead. For more information on supported file systems, see Storage sample attributes. Configuration management tools The infrastructure agent can be deployed programmatically using several config management and deploy tools: Ansible Chef Elastic Beanstalk Puppet For more help If you need more help, check out these support and learning resources: Browse the Explorers Hub to get help from the community and join in discussions. Find answers on our sites and learn how to use our support portal. Run New Relic Diagnostics, our troubleshooting tool for Linux, Windows, and macOS. Review New Relic's data security and licenses documentation.",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 91.59802,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "sections": "Install <em>and</em> configure the infrastructure agent",
        "info": "Compatibility information for infrastructure monitoring, including supported Linux <em>and</em> Windows versions.",
        "category_1": "Install <em>and</em> configure the infrastructure agent",
        "body": " monitor Amazon BottleRocket workloads: When running EC2 instances, <em>use</em> the containerized agent. On EKS, install the <em>Kubernetes</em> <em>integration</em>. For ECS clusters, deploy the ECS <em>integration</em>. Unique hostname The infrastructure agent uses the hostname to uniquely identify each server. To avoid inaccurate"
      },
      "id": "5f57ecf0e7b9d21d5facfd7b"
    },
    {
      "category_2": "Specifications",
      "nodeid": 36771,
      "sections": [
        "Infrastructure Integrations SDK",
        "Get started",
        "Specifications",
        "Troubleshooting",
        "On-host integration configuration overview",
        "Overview of how configuration works",
        "Configuration file location",
        "Configuration formats",
        "For more help"
      ],
      "title": "On-host integration configuration overview",
      "category_0": "Create integrations",
      "type": "docs",
      "category_1": "Infrastructure Integrations SDK",
      "external_id": "4b1d37e1ea3294fafb8fe4986882cca145a4982d",
      "image": "",
      "url": "https://docs.newrelic.com/docs/create-integrations/infrastructure-integrations-sdk/specifications/host-integration-configuration-overview",
      "published_at": "2021-02-23T02:57:52Z",
      "updated_at": "2021-02-16T01:04:30Z",
      "breadcrumb": "Contents / Create integrations / Infrastructure Integrations SDK / Specifications",
      "document_type": "page",
      "popularity": 1,
      "info": "Configuration overview of New Relic's on-host integrations.",
      "body": "New Relic's on-host integrations send data to the infrastructure agent, which in turn sends that data to New Relic. How integrations interact with the agent is controlled by each integration's config. Understanding more about configuration can help you troubleshoot issues with your on-host integration. Overview of how configuration works New Relic's on-host integrations are external programs executed by the infrastructure agent. Each integration monitors a specific service. An integration has, at minimum, these files: An executable that exports various types of data in a JSON format expected by the agent One or more YAML-format config files (for example, the Apache integration configuration). (We recommend linting YAML config files before use to avoid formatting issues.) Note that in addition to the specific on-host integration's configuration, you can also edit the infrastructure agent's configuration. Configuration file location With standard on-host integration installations, the configuration is located in the infrastructure agent's directory. The agent determines this config location by a setting in its own configuration file. For some implementations, the integration's configuration will be located elsewhere. For example: Services running on Kubernetes: The configuration is located in the Kubernetes integration config file. Services running on Amazon ECS: The configuration is placed in the AWS console. Configuration formats On-host integrations use two configuration formats: Standard: This is the format used by most on-host integrations. This configuration uses two files: a definition file and a configuration file. For more details, see Standard configuration. Newer: Starting December 2019, infrastructure agent version 1.8.0 began supporting a new format used by some integrations. This format uses a single configuration file and provides other improvements. For more details, see Newer configuration. For more help",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 90.220955,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "title": "On-host <em>integration</em> configuration overview",
        "sections": "Infrastructure <em>Integrations</em> SDK",
        "info": "Configuration overview of New Relic&#x27;s on-host <em>integrations</em>.",
        "category_0": "Create <em>integrations</em>",
        "category_1": "Infrastructure <em>Integrations</em> SDK",
        "body": "&#x27;s configuration will be located elsewhere. For example: Services running on <em>Kubernetes</em>: The configuration is located in the <em>Kubernetes</em> <em>integration</em> config file. Services running on Amazon ECS: The configuration is placed in the AWS console. Configuration formats On-host <em>integrations</em> <em>use</em> two configuration",
        "breadcrumb": "Contents &#x2F; Create <em>integrations</em> &#x2F; Infrastructure <em>Integrations</em> SDK &#x2F; Specifications"
      },
      "id": "5f2b10cee7b9d2db70bf4a30"
    }
  ],
  "/docs/apm/new-relic-apm/apdex/change-your-apdex-settings": [
    {
      "image": "https://newrelic.com/themes/custom/curio/assets/images/metadata/NROG_Image.png",
      "url": "https://newrelic.com/press-releases/20090715",
      "sections": [
        "Apdex Alliance Certifies New Relic’s Application Management Solution",
        "About The Apdex Alliance",
        "About New Relic",
        "Media Contact",
        "Investor Contact"
      ],
      "published_at": "2021-02-22T14:47:05Z",
      "title": "Apdex Alliance Certifies New Relic’s Application Management Solution | New Relic",
      "updated_at": "2021-02-22T14:47:04Z",
      "type": "",
      "external_id": "adc5c31dc3f37100905ce5ebe75790b9004d4cb3",
      "popularity": 1,
      "body": "Skip to main content New Relic logo Search Submit Products Products New Relic One Platform Overview Telemetry Data Platform Full-Stack Observability Applied Intelligence Pricing Solutions Solutions By Topic DevOps Cloud Adoption Cloud Native Digital Customer Experience Tool Consolidation Open Source By Industry E-commerce and Retail Media Public Sector By Technology Amazon Web Services Pivotal Cloud Foundry Microsoft Azure Google Cloud Platform Kubernetes Help Center Help Center Learn Docs Build on New Relic Explore open source projects Training The Relicans Get help Community forum Global technical support Expert services About About Our Customers Over 17,000 customers love New Relic, from Fortune 500 enterprises to small businesses around the globe. Our Blog The latest news, tips, and insights from the world of New Relic and digital intelligence. Our Company About Us Leadership Meetups and Events Resources Social Impact Investor Relations Newsroom Partner Program Contact Us New Relic for iOS or Android New Relic Insights App for iOS Search toggle Log in Sign up Main navigation menu, 5 items Newsroom Press Release Apdex Alliance Certifies New Relic’s Application Management Solution RPM offers Apdex reporting and measurement to help improve application and business performance Share on Facebook Share on Twitter Share on LinkedIn San Francisco - July 15, 2009 New Relic, Inc., a leading provider of application performance management solutions, today announced that its RPM product has been certified as an Apdex compliant product by the Apdex Alliance. RPM provides Apdex metrics in application status dashboards and in detailed reports, making it easier to ensure applications are meeting end-user expectations and application performance goals. Developed by an alliance of companies concerned with helping application providers ensure end-user satisfaction, Apdex (Application Performance Index) is an open standard that defines a method for reporting, benchmarking, and tracking user satisfaction with application performance. By specifying a uniform way to measure and report user experiences, the Apdex standard helps companies assure that their applications are meeting customer needs as well as business objectives. \"We are very pleased to add New Relic RPM to the growing list of products in our certification program,\" said Peter Sevcik, Apdex Alliance executive director. \"RPM extends Apdex with capabilities that make it easier for application managers to understand when and why applications are not performing. As a member of the Apdex Alliance, New Relic shares our commitment to ensuring that enterprises can improve application and IT infrastructure performance, and better align business with IT.\" RPM is a subscription-based performance management solution that enables IT operations and developers to quickly and cost-effectively monitor, troubleshoot, and tune performance in real time. The metrics provided by RPM allow rapid discovery and analysis of performance bottlenecks and their root causes. In addition, RPM uses the Apdex performance index to continuously score applications based on the end user’s experience. With RPM’s Apdex scoring, developers and application owners can agree upon the response time goals for each application and use a simple metric to measure whether they are achieving those goals. Furthermore, with this information, managers can quickly see which applications need improvement or investment. \"The Apdex standard provides a great way to prioritize which parts of your application should be optimized first,\" said Bill Harding, founder of Bonanzle, a leading online marketplace, and New Relic customer. \"New Relic’s application performance management solution makes Apdex measurement practicable by providing a very coherent and readable graphical interface that lets you rapidly determine when a production application needs to be optimized. This way, you eliminate time spent creating subjective criteria and time spent measuring which parts of the app aren’t meeting that criteria.\" \"This standard is an important part of effective application management, and New Relic customers around the world benefit tremendously from RPM’s Apdex reporting and measurement,\" said Lew Cirne, CEO of New Relic. \"RPM provides valuable, real-time insight into application uptime, performance, and end-user response times. The certification by the Apdex Alliance provides validation that RPM offers essential capabilities for consistently improving business performance and end-user satisfaction.\" About The Apdex Alliance The Apdex Alliance is a group of companies collaborating to define and promote an application performance metric called Apdex, a numerical measure of user satisfaction with the performance of enterprise applications, and reflects the effectiveness of IT investments in contributing to business objectives. Founded in 2004 by Peter Sevcik of NetForecast, Apdex is available to any organization seeking insight into their IT investments. Visit www.Apdex.org for more information. Back to press releases About New Relic The world’s best engineering teams rely on New Relic to visualize, analyze and troubleshoot their software. New Relic One is the most powerful cloud-based observability platform built to help companies create more perfect software. Learn why customers trust New Relic for improved uptime and performance, greater scale and efficiency, and accelerated time to market at newrelic.com. New Relic is a registered trademark of New Relic, Inc. All product and company names herein may be trademarks of their registered owners. New Relic on Facebook New Relic on Twitter New Relic on LinkedIn New Relic on YouTube Media Contact Andrew Schmitt 415-869-7109 PR@newrelic.com Investor Contact Peter Goldmacher 503-336-9280 IR@newrelic.com Company Careers and Culture Partner Program Investor Relations NewRelic.org Suppliers Portal Connect Contact Us Request Demo Events International 日本語 Français Deutsch 한국어 Facebook Twitter LinkedIn YouTube Instagram Terms of Service DMCA Policy Privacy Policy Cookie Policy UK Slavery Act of 2015 ©2008-21 New Relic, Inc. All rights reserved",
      "info": "",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 93.440834,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "title": "<em>Apdex</em> Alliance Certifies <em>New</em> <em>Relic’s</em> Application Management Solution | <em>New</em> <em>Relic</em>",
        "sections": "<em>Apdex</em> Alliance Certifies <em>New</em> <em>Relic’s</em> Application Management Solution",
        "body": " Meetups and Events Resources Social Impact Investor Relations Newsroom Partner Program Contact Us <em>New</em> <em>Relic</em> for iOS or Android <em>New</em> <em>Relic</em> Insights App for iOS Search toggle Log in Sign up Main navigation menu, 5 items Newsroom Press Release <em>Apdex</em> Alliance Certifies <em>New</em> <em>Relic</em>’s Application Management"
      },
      "id": "575f8b790755233594057b70"
    },
    {
      "image": "https://newrelic.com/themes/custom/curio/assets/images/metadata/NROG_Image.png",
      "url": "https://newrelic.com/press-releases/20090303",
      "sections": [
        "New Relic Joins Apdex Alliance",
        "About Apdex",
        "About New Relic",
        "Media Contact",
        "Investor Contact"
      ],
      "published_at": "2021-02-22T14:46:39Z",
      "title": "New Relic Joins Apdex Alliance | New Relic",
      "updated_at": "2021-02-22T14:46:39Z",
      "type": "",
      "external_id": "b707ee9031ed57f66e704caadea49b5f7d6e84d8",
      "popularity": 1,
      "body": "Skip to main content New Relic logo Search Submit Products Products New Relic One Platform Overview Telemetry Data Platform Full-Stack Observability Applied Intelligence Pricing Solutions Solutions By Topic DevOps Cloud Adoption Cloud Native Digital Customer Experience Tool Consolidation Open Source By Industry E-commerce and Retail Media Public Sector By Technology Amazon Web Services Pivotal Cloud Foundry Microsoft Azure Google Cloud Platform Kubernetes Help Center Help Center Learn Docs Build on New Relic Explore open source projects Training The Relicans Get help Community forum Global technical support Expert services About About Our Customers Over 17,000 customers love New Relic, from Fortune 500 enterprises to small businesses around the globe. Our Blog The latest news, tips, and insights from the world of New Relic and digital intelligence. Our Company About Us Leadership Meetups and Events Resources Social Impact Investor Relations Newsroom Partner Program Contact Us New Relic for iOS or Android New Relic Insights App for iOS Search toggle Log in Sign up Main navigation menu, 5 items Newsroom Press Release New Relic Joins Apdex Alliance As a Member, New Relic supports the Apdex open standard — an objective method of reporting, benchmarking, and tracking application performance Share on Facebook Share on Twitter Share on LinkedIn San Francisco - March 3, 2009 New Relic, Inc., the leading provider of Ruby on Rails application performance management solutions, today announced that that it has become a contributing member of the Apdex Alliance. The Alliance seeks to define and promote Apdex, an open standard for measuring application user satisfaction using a consistent and objective scoring approach. \"We see Apdex as an important emerging standard in application performance,\" said Lew Cirne, founder and CEO of New Relic. \"Application developers are often confronted by the businesspeople in their companies with vague complaints about application performance. A scoring methodology like Apdex takes the fuzziness out of measuring and communicating user satisfaction. We are happy to support the adoption of the standard by joining the Apdex Alliance.\" \"As one of the leading providers of application performance management tools, New Relic is certainly an ideal member of the Alliance,\" said Peter Sevcik, founder and executive director of the Apdex Alliance. \"We are very pleased they have joined to promote adoption of this valuable methodology.\" About Apdex Apdex is the first user experience metric that is comparable across all transactional applications. Thus, an operations manager has a single measurement to compare performance across applications. Managers can quickly see which applications need improvement or investment, those that have a low Apdex value but are important to the business. Apdex also lets developers measure the effectiveness of performance improvement investments. An Apdex value should improve with a performance-driven upgrade. More information can be found at www.apdex.org. Back to press releases About New Relic The world’s best engineering teams rely on New Relic to visualize, analyze and troubleshoot their software. New Relic One is the most powerful cloud-based observability platform built to help companies create more perfect software. Learn why customers trust New Relic for improved uptime and performance, greater scale and efficiency, and accelerated time to market at newrelic.com. New Relic is a registered trademark of New Relic, Inc. All product and company names herein may be trademarks of their registered owners. New Relic on Facebook New Relic on Twitter New Relic on LinkedIn New Relic on YouTube Media Contact Andrew Schmitt 415-869-7109 PR@newrelic.com Investor Contact Peter Goldmacher 503-336-9280 IR@newrelic.com Company Careers and Culture Partner Program Investor Relations NewRelic.org Suppliers Portal Connect Contact Us Request Demo Events International 日本語 Français Deutsch 한국어 Facebook Twitter LinkedIn YouTube Instagram Terms of Service DMCA Policy Privacy Policy Cookie Policy UK Slavery Act of 2015 ©2008-21 New Relic, Inc. All rights reserved",
      "info": "",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 93.155624,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "title": "<em>New</em> <em>Relic</em> Joins <em>Apdex</em> Alliance | <em>New</em> <em>Relic</em>",
        "sections": "<em>New</em> <em>Relic</em> Joins <em>Apdex</em> Alliance",
        "body": " Meetups and Events Resources Social Impact Investor Relations Newsroom Partner Program Contact Us <em>New</em> <em>Relic</em> for iOS or Android <em>New</em> <em>Relic</em> Insights App for iOS Search toggle Log in Sign up Main navigation menu, 5 items Newsroom Press Release <em>New</em> <em>Relic</em> Joins <em>Apdex</em> Alliance As a Member, <em>New</em> <em>Relic</em> supports"
      },
      "id": "575f8b81c75d0754f7c392b2"
    },
    {
      "category_2": "iOS app release notes",
      "nodeid": 8411,
      "sections": [
        "Mobile apps release notes",
        "Android app release notes",
        "iOS app release notes",
        "Insights for Android release notes",
        "Insights for iOS release notes",
        "Insights for tvOS release notes",
        "New Relic for iOS 3.20.3",
        "New Relic for iOS 3.52.1",
        "Notes",
        "New features",
        "Improvements",
        "New Relic for iOS 3.51.1",
        "New Relic for iOS 3.50.0",
        "New Relic for iOS 3.49.0",
        "Bug fixes",
        "New Relic for iOS 3.48.0",
        "New Relic for iOS 3.47.0",
        "New Relic for iOS 3.46.1",
        "New Relic for iOS 3.46.0",
        "New Relic for iOS 3.45.0",
        "Pages"
      ],
      "title": "New Relic for iOS 3.20.3",
      "category_0": "Release notes",
      "type": "docs",
      "category_1": "Mobile apps release notes",
      "external_id": "9669033863e7160d64a91d6de37637bd8e50e0f6",
      "image": "",
      "url": "https://docs.newrelic.com/docs/release-notes/mobile-apps-release-notes/new-relic-ios-3203?page=0%2C2",
      "published_at": "2021-02-24T14:12:18Z",
      "updated_at": "2021-02-24T14:12:17Z",
      "breadcrumb": "Contents / Release notes / Mobile apps release notes / iOS app release notes",
      "document_type": "release_notes",
      "popularity": -2,
      "body": "[RSS] Items per page 5 10 New Relic for iOS 3.52.1 Tuesday, November 12, 2019 - 09:00 Download Notes Support for iOS 13 dark mode!!! New features Dark mode support for iOS 13 New crashes tab in Mobile APM, with improved grouping, searching and filtering Added in Synthetics monitors to the iPad Improvements Fix for showing a retry login popup when we shouldn't be Enable auto resizing of the y axis in charts, to scale to the visible time window Update APM app error rate to reflect the web New Relic for iOS 3.51.1 Friday, September 13, 2019 - 14:30 Download Notes The New Relic app is even better with an improved home screen, displaying all your favorite services, hosts, mobile and browser apps, key transactions, and more. This enhanced landing page also allows you to search across services, apps and hosts! New features Added new home screen with favorite APM, Mobile, and Browser apps, Infrastructure hosts, key transactions, and plugin instances. Added search to the home screen, to quickly search across APM, Mobile, Browser apps, hosts and key transactions. Improvements Updated Infrastructure, when viewing a filter set, to show all hosts in the charts (up to 20) by default. New Relic for iOS 3.50.0 Wednesday, July 31, 2019 - 12:00 Download Notes Improved and redesigned Browser product within the app! New features New Browser single page app (SPA) overview charts Added support to display in progress Browser violations and recent events Added support to display Browser page views Added support to display Browser JS errors Improvements Improved real agents call in APM Added link in app to license documentation New Relic for iOS 3.49.0 Wednesday, May 15, 2019 - 10:00 Download Notes Synchronizes app favorites with New Relic One for a consistent way to get access to those APM apps, Browser apps, Mobile apps, and Synthetics monitors wherever you might be. Improvements Uses the same data source for favorites as New Relic One Merges any iPhone / iPad specific favorites into your New Relic One favorites Updates Apdex charts to zoom in on the y axis to better show smaller variations Update Transaction trace bar to closer match the web in some edge cases Bug fixes Fixed an issue where searching in the APM Error attributes or stack traces would result in strange behavior Fixes an issue in the host / instance popup where the web response time was off by an order of magnitude New Relic for iOS 3.48.0 Thursday, April 11, 2019 - 09:00 Download New features Additional information for Java instances and Elixir hosts in the APM application detail section. New host / instance drop down for APM applications showing summary information, and allowing you to filter the APM page to a specific host or instance. Improvements Update to the Mobile APM summary page to allow the view to load for more customers New Relic for iOS 3.48.0 Thursday, April 11, 2019 - 09:00 Download Notes Our new APM memory / threads section now works with Java & Elixir agents! Improvements Additional information for Java instances and Elixir hosts in the APM application detail section. New host / instance drop down for APM applications showing summary information, and allowing you to filter the APM page to a specific host or instance. Update to the Mobile APM summary page, so that some edge cases will now load. New Relic for iOS 3.47.0 Monday, March 18, 2019 - 09:00 Download New features Additional information for hosts of Ruby, Node.js, and Go APM applications. Bug fixes Fixed a crash when tapping logout on the iPad Fixed for some Synthetics monitors not loading Fixed a few other infrequent crashes New Relic for iOS 3.46.1 Monday, February 11, 2019 - 09:00 Download Bug fixes Fixed the problem with muting, and enabling / disabling Synthetics monitors New Relic for iOS 3.46.0 Tuesday, January 29, 2019 - 14:15 Download Improvements Updated account settings screen enables seamless transition between users and accounts Bug fixes Fixed rare crash when saml users return from authenticating New Relic for iOS 3.45.0 Thursday, January 3, 2019 - 14:15 Download Notes This version contains enhanced notifications, with support for selecting unique sounds for different types of notifications, along with showing a chart image for incidents. New features Select different notification sounds for push notifications to the app. Shows incident open / closed chart image in the notification. Bug fixes Fix for filtering apmApplicationIds and apmApplicationNames properly in Infrastructure. Fixed a crash when trying to search through plugin components. Fixed a crash in Radar. Pages « first ‹ previous 1 2 3 4 5 6 7 8 9 next › last »",
      "info": "",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 87.74814,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "title": "<em>New</em> <em>Relic</em> for iOS 3.20.3",
        "sections": "<em>New</em> <em>Relic</em> for iOS 3.20.3",
        "body": "[RSS] Items per page 5 10 <em>New</em> <em>Relic</em> for iOS 3.52.1 Tuesday, November 12, 2019 - 09:00 Download Notes Support for iOS 13 dark mode!!! <em>New</em> features Dark mode support for iOS 13 <em>New</em> crashes tab in Mobile <em>APM</em>, with improved grouping, searching and filtering Added in Synthetics monitors to the iPad"
      },
      "id": "5b6b681ab5b9e13ebbb11a80"
    },
    {
      "image": "https://newrelic.com/themes/custom/curio/assets/images/metadata/NROG_Image.png",
      "url": "https://newrelic.com/press-releases/20090505",
      "sections": [
        "New Relic Releases New Version of its RPM Rails Performance Management Solution",
        "Application Capacity Management",
        "Apdex Support",
        "Custom Dashboard Creation Tools",
        "About New Relic",
        "Media Contact",
        "Investor Contact"
      ],
      "published_at": "2021-02-22T14:45:58Z",
      "title": "New Relic Releases New Version of its RPM Rails Performance Management Solution | New Relic",
      "updated_at": "2021-02-22T14:45:58Z",
      "type": "",
      "external_id": "33b9b02e5e771174c7f4a96a0bbf8efd569ed725",
      "popularity": 1,
      "body": "Skip to main content New Relic logo Search Submit Products Products New Relic One Platform Overview Telemetry Data Platform Full-Stack Observability Applied Intelligence Pricing Solutions Solutions By Topic DevOps Cloud Adoption Cloud Native Digital Customer Experience Tool Consolidation Open Source By Industry E-commerce and Retail Media Public Sector By Technology Amazon Web Services Pivotal Cloud Foundry Microsoft Azure Google Cloud Platform Kubernetes Help Center Help Center Learn Docs Build on New Relic Explore open source projects Training The Relicans Get help Community forum Global technical support Expert services About About Our Customers Over 17,000 customers love New Relic, from Fortune 500 enterprises to small businesses around the globe. Our Blog The latest news, tips, and insights from the world of New Relic and digital intelligence. Our Company About Us Leadership Meetups and Events Resources Social Impact Investor Relations Newsroom Partner Program Contact Us New Relic for iOS or Android New Relic Insights App for iOS Search toggle Log in Sign up Main navigation menu, 5 items Newsroom Press Release New Relic Releases New Version of its RPM Rails Performance Management Solution Leading SaaS provider adds Apdex support, business monitoring dashboards and cloud capacity management tool Share on Facebook Share on Twitter Share on LinkedIn Las Vegas -- RailsConf - May 5, 2009 New Relic, Inc., the leading provider of Ruby on Rails application performance management solutions, today announced that it has released Version 1.3 of RPM™, the most widely-used tool for managing Ruby on Rails web applications. Attendees at RailsConf, the largest conference dedicated to Ruby on Rails, being held this week in Las Vegas, can see the new version at the New Relic booth in the exhibit hall. \"This version brings very important new capabilities for RPM,\" said Lewis Cirne, founder and CEO of New Relic. \"With this release we have enabled developers to have a closer working relationship with their peers on the management side of the business. Apdex and custom dashboards will allow developers to communicate important business metrics to the managers of their companies. We have also added a just-in-time capacity management function that allows application managers to know exactly how much capacity they are using, how much they need, and to get notified exactly when they need to deploy more. This makes cloud’s promise of dynamic capacity a reality.\" Updates to RPM include the following: Application Capacity Management Each instance of an application consumes server capacity. Many applications require multiple processes to be deployed to handle the anticipated user traffic. Whether the application is deployed in a cloud infrastructure with highly dynamic management functions or deployed in a fixed number of servers at a hosting service, more application instance processes will result in higher hosting costs. RPM now allows continuous assessment of capacity utilization and enables RPM customers to right-size each application to the needed capacity. Application management teams can react more quickly to add or reduce capacity and find the balance between cost efficiency and high performance. Apdex Support RPM continuously scores applications or individual transaction types based on the end user’s experience using the Apdex performance index. Apdex is the first user experience metric that is comparable across all transactional applications. Using the Apdex score, developers and application owners can agree upon the response time goals for each application and have a simple metric which tells them whether they are achieving those goals. Additionally, an operations manager has a single measurement to compare performance across applications. Managers can quickly see which applications need improvement or investment, namely those that have a low Apdex value but are important to the business. RPM now includes the Apdex score in the application status dashboards and in more detailed reports. More information about Apdex or the Apdex Alliance can be found at www.apdex.org. Custom Dashboard Creation Tools With its unique visibility inside the running web application, RPM can provide continuous real-time monitoring of both application performance and transaction-level business performance. RPM customers can now quickly create their own dashboards with their preferred look and feel and include technical data and/or real time business information. For example, an e-commerce site can track numbers of new customer accounts, numbers of purchase transactions, returns, and cancellations and compare today’s data with same time last week or last month. All this can be done without any special new programs or databases. With real-time monitoring, business management can react quickly to changing customer behavior. Back to press releases About New Relic The world’s best engineering teams rely on New Relic to visualize, analyze and troubleshoot their software. New Relic One is the most powerful cloud-based observability platform built to help companies create more perfect software. Learn why customers trust New Relic for improved uptime and performance, greater scale and efficiency, and accelerated time to market at newrelic.com. New Relic is a registered trademark of New Relic, Inc. All product and company names herein may be trademarks of their registered owners. New Relic on Facebook New Relic on Twitter New Relic on LinkedIn New Relic on YouTube Media Contact Andrew Schmitt 415-869-7109 PR@newrelic.com Investor Contact Peter Goldmacher 503-336-9280 IR@newrelic.com Company Careers and Culture Partner Program Investor Relations NewRelic.org Suppliers Portal Connect Contact Us Request Demo Events International 日本語 Français Deutsch 한국어 Facebook Twitter LinkedIn YouTube Instagram Terms of Service DMCA Policy Privacy Policy Cookie Policy UK Slavery Act of 2015 ©2008-21 New Relic, Inc. All rights reserved",
      "info": "",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 85.80513,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "title": "<em>New</em> <em>Relic</em> Releases <em>New</em> Version of its RPM Rails Performance Management Solution | <em>New</em> <em>Relic</em>",
        "sections": "<em>New</em> <em>Relic</em> Releases <em>New</em> Version of its RPM Rails Performance Management Solution",
        "body": " Management Solution Leading SaaS provider adds <em>Apdex</em> support, business monitoring dashboards and cloud capacity management tool Share on Facebook Share on Twitter Share on LinkedIn Las Vegas -- RailsConf - May 5, 2009 <em>New</em> <em>Relic</em>, Inc., the leading provider of Ruby on Rails application performance"
      },
      "id": "575f8b7c0cc37f04e3aad6de"
    },
    {
      "image": "https://cc.sj-cdn.net/instructor/1h7ahmdd447dx-new-relic/themes/3c4jawy1asa1h/header-logo.1595599299.png",
      "url": "https://learn.newrelic.com/page/programmability",
      "sections": [],
      "published_at": "2021-02-26T01:40:50Z",
      "title": "Programmability",
      "updated_at": "2021-02-26T01:40:49Z",
      "type": "",
      "external_id": "b7fa2a066dbf9b6f8c542a86a1b833e88ea77ddb",
      "popularity": 1,
      "body": "Back Sign In Searching... Plans Courses Lessons Reset Live Learncast: New Relic One Programmability Join us for this exclusive 90-minute introduction to the fundamentals of New Relic One Programmability. This training will introduce you to the key concepts and walk you through developing New Relic Applications. FREE GraphQL APIAPIUpcoming WebcastsNew Relic OneNew Relic APIs What’s New - The New Relic Data Exploration Experience Exploring your data in New Relic is now more intuitive than ever. In this session we’ll take a look at what’s changed with our latest Data Exploration release and how it makes your life easier. FREE New Relic APIs Learn how to use a variety of New Relic APIs, including the GraphQL API, the Insights Insert API, and the APM Agent API. FREE IntroductoryCustomize DataAdvancedTutorialGraphQL APIAPINew Relic APIs Navigating APM Learn how to navigate New Relic APM UI and interpret chart data so you can improve your application's performance and troubleshoot complex applications faster. FREE Go Deeper: Advanced Alerting & NRQL Alerts Delve deeper into Alerts and move beyond the basics to implement an effective alerting strategy in this FREE 2 hour workshop. With scenario based labs, you’ll create specific policies and conditions for typical use cases, leverage powerful NRQL alerts, and manage alerts for downtime or maintenance scenarios. FREE New Relic Infrastructure Fundamentals In this course, you'll learn how New Relic Infrastructure provides deep visibility into cloud and on-premises environments. New Relic Infrastructure connects the health and performance of infrastructure to the richest metrics, events, logs, and traces to provide context for supporting our customers’ applications. FREE Performance Monitoring Fundamentals In this course, you’ll learn how you can use the New Relic Digital Intelligence Platform to get end-to-end visibility into the performance of your websites and apps, the customer experiences they deliver, and their effect on your business. FREE APMTutorialBrowserself-serveNew Relic InsightsNew Relic InfrastructureNew Relic FundamentalsPerformance Monitoring Fundamentals APM for Power Users Level up your digital intelligence and become an APM Power User. In this course, you learn to use advanced performance monitoring features. FREE Become a power userAPMPower UserAdvancedTutorialAPM for Power Users New Relic APM Fundamentals In this course, you'll learn how to use New Relic APM to see what's happening in your application, understand where the problems are, discover opportunities for optimizing your entire application ecosystem, and make sure you never miss an issue that needs attention. FREE New Relic APM Fundamentals New Relic Insights + APM Fundamentals In this course, you'll learn how to create an Insights dashboard in the UI and from a JSON template, add APM charts, and edit your Dashboard. This course culminates in a live virtual training where you'll learn how to analyze your APM data in Insights. FREE New Relic Insights + APM FundamentalsNew Relic APM Fundamentalsabracadabra New Relic Alerts Fundamentals (Legacy) Learn how to use the New Relic platform Alerts tool to monitor performance and know when leading performance indicators spike or drop so you can catch problems before they reach your end user. Enable team members to get the alerts they need faster and achieve lower response times. FREE New Relic Alerts Fundamentals New Relic One Overview New Relic One is the industry’s largest and most comprehensive cloud-based observability platform built to help customers create more perfect software. In the pursuit of our vision, we have enhanced New Relic One to provide a simplified and frictionless experience for customers. FREE Get Started with APM Let's get started together. We're going to take you through the basics to manage your application and services. FREE Get StartedGet CertifiedIntroductoryAPMTutorialGetting-Startedself-serveGet Started with APMNew Relic APM Getting started with Dashboards & NRQL Learn to use the Data Explorer and Query Builder Basic Mode to create charts and dashboards without any knowledge of NRQL. Progress to working directly with NRQL to create a wider range of charts and visualizations. FREE New Relic Distributed Tracing: Tracking Across Your Application Stacks In this practical session you’ll find out about how New Relic Distributed Tracing can extend your transaction tracing capabilities for distributed systems, and understand how Distributed Tracing works and can be configured for different environments. FREE Maximizing Observability with New Relic Logs This workshop is a comprehensive introduction to understanding and working with Logs in New Relic. Get hands-on with your data. Practice importing logs and then parsing, filtering, dropping, and alerting on log data in New Relic One. FREE Getting Started with Synthetics Learn how to use Synthetics to test your app from different global locations, simulate user flows and interactions, check the performance of individual page components, and fix problems before they affect the end-user's experience. FREE Get StartedMonitor PerformancePower UserTutorialSyntheticsNew Relic Synthetics Getting Started with Insights Learn how to use New Relic Insights to analyze and present custom, real-time data visualizations. FREE Get StartedIntroductoryInsightsTutorialNew Relic Insights Getting Started with Infrastructure Learn New Relic Infrastructure fundamentals to get a precise picture of your dynamically changing systems. New Relic Infrastructure delivers real-time health metrics correlated with recent configuration changes, so you can quickly resolve issues, scale rapidly, and deploy intelligently. FREE Get StartedInfrastructureMonitor PerformancePower UserTutorialNew Relic Infrastructure New Relic Alerts Fundamentals In this engaging FREE 2 hour workshop is an introduction to understanding and working with Alerts in New Relic. It will enable you to set up a range of Alert policies, understand how different conditions operate, and learn how to work with incidents when issues arise. FREE Custom Data with Insights Learn how to take your application performance analysis to the next level. Add context and get more detailed results with custom attributes, or by importing additional datasets. This course will show you how to import JSON data to the Insights API endpoint, alongside default data captured natively. FREE Power UserInsightsCustomize DataAdvancedTutorialCustom Data with Insights Insights Dashboards and Data Apps Learn how to use Insights Dashboards and Data Apps to analyze any data type from across all New Relic products in real-time and present a variety of metrics and visualizations in a meeting or on the go, embed charts into your own application, or create self-service dashboards for other teams. FREE Get StartedMonitor PerformanceGet CertifiedPower UserInsightsTutorialInsights DashboardsDashboards and Data Apps Writing NRQL Queries Learn how to ask questions about your data using NRQL, New Relic's SQL-flavored query language, and create beautiful visualizations for analyzing your data in real-time. FREE Get StartedBecome a power userGet CertifiedIntroductoryInsightsTutorialCloud AdoptionApplication Baselineself-serveWriting NRQL Queries New Relic Alerts Learn how to use the New Relic platform Alerts tool to monitor performance and know when leading performance indicators spike or drop so you can catch problems before they reach your end user. Enable team members to get the alerts they need faster and achieve lower response times. FREE AlertsGet StartedIntroductoryAPMPower UserTutorialNew Relic Alerts Performance Monitoring with New Relic In this course, you’ll learn how you can use the New Relic Digital Intelligence Platform to get end-to-end visibility into the performance of your websites and apps, the customer experiences they deliver, and their effect on your business. FREE AlertsGet StartedInfrastructureIntroductoryAPMInsightsTutorialSyntheticsBrowserMobile monitoringself-servePerformance Monitoring with New Relic Part of: © 2021 powered by",
      "info": "",
      "_index": "520d1d5d14cc8a32e600034b",
      "_type": "520d1d5d14cc8a32e600034c",
      "_score": 83.23994,
      "_version": null,
      "_explanation": null,
      "sort": null,
      "highlight": {
        "body": " it makes your life easier. FREE <em>New</em> <em>Relic</em> APIs Learn how to use a variety of <em>New</em> <em>Relic</em> APIs, including the GraphQL API, the Insights Insert API, and the <em>APM</em> Agent API. FREE IntroductoryCustomize DataAdvancedTutorialGraphQL APIAPINew <em>Relic</em> APIs Navigating <em>APM</em> Learn how to navigate <em>New</em> <em>Relic</em> <em>APM</em> UI"
      },
      "id": "5f22778128ccbca80432c20c"
    }
  ]
}